{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-rules-change-oppn-claims-salaried-people-being-punished-for-govts-mishandling-of-economy-2803625-2025-10-15",
      "headline": "Opposition slams Centre's EPFO rules, says salaried employees being punishedThe opposition slammed the Modi government over new EPFO rules, accusing it of punishing salaried employees for \"economic mismanagement.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-500-points-higher-nifty-above-25300-bajaj-finance-up-4-percent-2803501-2025-10-15",
      "headline": "Sensex ends 575 points higher, Nifty above 25,300; Bajaj Finance up 4%The S&P BSE Sensex added 575.45 points to end at 82,605.43, while the NSE Nifty50 gained 178.05 points to close at 25,323.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blending-sugar-industry-urges-government-demand-push-ifge-isma-request-2803476-2025-10-15",
      "headline": "Sugar sector urges government to push ethanol blending beyond 20%: ReportEthanol producers have collectively offered 17,760 million litres for the ethanol supply year 2025–26 (ESY), which far exceeds the oil marketing companies' (OMCs) annual requirement of around 10,500 million litres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expecting-your-entire-ctc-as-salary-heres-the-reality-check-2803474-2025-10-15",
      "headline": "Expecting your entire CTC as salary? Here's the reality checkMany first-time earners walk into their jobs assuming the number on their offer letter will land in their bank account. But when the first payslip arrives, reality hits hard. The gap between CTC and take-home pay is bigger than most realise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-nears-rs-13-lakh-is-it-wise-to-buy-before-dhanteras-gold-price-should-you-buy-or-sell-gold-2803427-2025-10-15",
      "headline": "Gold nears Rs 1.3 lakh. Is it wise to buy before Dhanteras?As gold inches close to Rs 1.3 lakh per 10 grams, festive shoppers are facing a dilemma. With Dhanteras around the corner, the big question is simple: buy now or hold off in hope of a dip?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-500-points-dalal-street-optimism-explained-2803390-2025-10-15",
      "headline": "Sensex jumps 500 points: What's driving today's stock market rallyBy mid-morning, the S&P BSE Sensex had gained 474.63 points to 82,504.61, while the NSE Nifty50 rose 161.90 points to 25,309.65. Most other indices across sectors also saw healthy gains, reflecting broad-based buying."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-goldman-sachs-planning-job-cuts-to-make-way-for-its-ai-strategy-2803369-2025-10-15",
      "headline": "Is Goldman Sachs planning to cut jobs? Check hereGoldman Sachs is gearing up for another round of layoffs as it speeds up its shift towards artificial intelligence under its OneGS 3.0 strategy, mention reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-picks-2025-portfolio-guide-stock-market-samvat-2082-nifty-outlook-2803344-2025-10-15",
      "headline": "Diwali Picks 2025: How can you build your portfolio this festive season As markets steady ahead of Diwali, analysts say the current calm could be the base for the next rally — a chance to quietly build wealth before the noise returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/q2-earnings-lift-it-stocks-should-investors-join-invest-in-infosys-tcs-hlctech-persistent-2803343-2025-10-15",
      "headline": "Q2 earnings lift IT stocks, but should investors join the rally?Experts suggest that while the IT sector looks promising in the short term, investors should take a cautious approach and focus on selective stocks that show consistent growth potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-200-points-higher-nifty-above-25200-ntpc-up-1-percent-2803315-2025-10-15",
      "headline": "Sensex opens over 200 points higher, Nifty above 25,200; NTPC up 1%The S&P BSE Sensex added 322.86 points to 82,352.84, while the NSE Nifty50 gained 105.50 points to 25,250.55 as oif 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-korean-md-speech-hong-ju-jeon-bumper-listing-50-percent-premium-market-debut-hold-or-sell-2803276-2025-10-15",
      "headline": "LG Electronics IPO rocks NSE, and so does LG's Korean MD with his speechLG Electronics India's Korean Managing Director, Hong Ju Jeon, won hearts across India when he addressed the audience entirely in Hindi at the company's listing ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-eases-withdrawal-rules-but-there-is-a-catch-details-here-100-percent-pf-withdrawal-2803041-2025-10-15",
      "headline": "EPFO eases withdrawal rules, but there is a catch. Details HereThe EPFO has made a big change by allowing members to withdraw their entire provident fund balance. Still, the revised rules include a major catch that not everyone may find favourable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunjay-kapur-will-dispute-gambling-allegations-validity-concerns-2803053-2025-10-14",
      "headline": "No proof Sunjay Kapur drafted will: Karisma Kapoor's kids call Priya acute gamblerIn the ongoing Sunjay Kapur property dispute, senior advocate Mahesh Jethmalani, representing actor Karisma Kapoor's children, slammed the late industralist's widow, Priya Kapur, calling her an \"acute gambler\" and saying there was no proof whether Sunjay Kapur had actually drafted the will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/best-sectors-stock-market-investment-long-term-portfolio-ev-logistics-power-equipment-auto-2802991-2025-10-14",
      "headline": "Diwali 2025: Expert lists best sectors to light up your long-term portfolioOnce seen as a risky bet for the daring few, it's now finding a place right beside traditional investments. From young professionals buying their first mutual fund to families creating demat accounts, the shift is real and growing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-297-points-lower-nifty-below-25200-dr-reddys-falls-over-2-2802947-2025-10-14",
      "headline": "Sensex, Nifty end lower amid profit booking; LG Electronics listing lights up D-StreetThe S&P BSE Sensex slipped 297.07 points to close at 82,029.98, while the NSE Nifty50 dropped 81.85 points to settle at 25,145.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-chief-kristalina-georgieva-india-praise-proving-doubters-wrong-economic-reforms-2802924-2025-10-14",
      "headline": "India proving doubters wrong with its economic reforms: IMF chiefSpeaking ahead of the IMF-World Bank annual meetings in Washington, Georgieva said India's strong economic policies and reforms have helped it stand out as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-stocks-why-you-should-track-gold-and-silver-rally-this-diwali-2802910-2025-10-14",
      "headline": "Forget stocks, why should you track gold and silver rally this DiwaliWith markets showing uncertainty, should investors consider precious metals over stocks this festive season? Experts explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-ipo-sees-bumper-listing-why-you-shouldnt-sell-entire-stake-today-2802905-2025-10-14",
      "headline": "LG Electronics IPO sees bumper listing. Why you shouldn't sell entire stake todayLG Electronics IPO surged over 50% on listing, but should investors sell everything today or hold for bigger gains?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-finance-is-not-foolproof-cautions-zerodha-founder-ceo-nithin-kamath-2802838-2025-10-14",
      "headline": "Digital finance isn't foolproof, cautions Zerodha's Nithin KamathFrom Aadhaar e-Sign to mobile apps, digital finance has transformed access to financial services in India. However, Nithin Kamath points out that system failures and delays still pose challenges for users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bira-91-beer-disappeared-wine-shops-bars-legal-name-change-leadership-change-failure-transparency-salary-delay-2802466-2025-10-14",
      "headline": "Bira 91 went poof! And the name change was just the beer headWhile several news reports said that a change in the name of Indian beer Bira 91 spelt doom for the craft beer brand, it was just the tip of the iceberg. The company is facing a Rs 80-crore loss, supply-chain disruption, and most importantly, internal unrest, with employees demanding the ouster of founder Ankur Jain. This is what industry insiders have to say about the mess at Bira 91."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ganesh-malvika-sharma-new-romantic-family-drama-mysuru-kerala-shoots-2803578-2025-10-15",
      "headline": "Malvika Sharma set for Kannada debut with Ganesh's upcoming film: Reports Malvika Sharma is reportedly set to make her Kannada debut opposite Ganesh in Srinivas Raju's upcoming romantic family drama, which is eyeing an early 2026 release.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakhi-sawant-husband-fir-quashed-divorce-proceedings-2803555-2025-10-15",
      "headline": "Rakhi Sawant, husband quash FIRs against each other; divorce proceedings soon The Bombay High Court has quashed FIRs filed by Rakhi Sawant and her husband, Adil Durrani, amid their marital discord. The couple will now proceed with divorce, having agreed to settle their disputes amicably."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-launches-new-album-aura-1st-video-kufar-stars-manushi-chhillar-2803549-2025-10-15",
      "headline": "Diljit Dosanjh launches new album AURA, 1st video Kufar stars Manushi Chhillar Diljit Dosanjh released his new 10-track album AURA, with lyrics by Raj Randhodh and production by several artistes. The music video for 'Kufar' features Manushi Chhillar and includes distinct visual settings and themes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-durgha-tej-sambarala-yeti-gattu-glimpse-epic-battle-rebellion-2803526-2025-10-15",
      "headline": "Sai Durgha Tej's SYG Asura Aagamana glimpse promises grandeur and an epic battle 'Sambarala Yeti Gattu', featuring Sai Durgha Tej and Aishwarya Lekshmi, teases a gripping period action spectacle with its new 'Asura Aagamana' glimpse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-resurrection-of-the-christ-jaakko-ohtonen-to-play-jesus-in-mel-gibson-film-2803513-2025-10-15",
      "headline": "The Resurrection of the Christ: Jaakko Ohtonen to play Jesus in Mel Gibson's film Finnish actor Jaakko Ohtonen has replaced Jim Caviezel as Jesus in Mel Gibson's new film. 'The Resurrection of the Christ' will begin filming in Rome, promising a fresh take with a new cast and split release in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-takes-over-as-director-of-magudam-to-steer-film-amid-creative-differences-2803447-2025-10-15",
      "headline": "Vishal takes over Magudam after creative differences with director Ravi Arasu Actor Vishal took over 'Magudam' as a director amid creative differences with Ravi Arasu. The film features Dushara Vijayan, Anjali, and Yogi Babu and is produced by Super Good Films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/laurence-fishburne-wants-to-play-professor-x-in-marvel-new-x-men-instalment-2803462-2025-10-15",
      "headline": "Laurence Fishburne wants to play Professor X in Marvel's new X-Men instalment Actor Laurence Fishburne has expressed his interest in portraying Professor Charles Xavier in the next 'X-Men' film. His proposal comes amid speculations about the future of the Marvel Cinematic Universe superhero franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bjp-leader-annamalai-praises-dhanush-idly-kadai-portrayal-youth-issues-village-life-2803467-2025-10-15",
      "headline": "Annamalai praises Dhanush's Idli Kadai: Like Rishab, you excel as director, actor BJP's Annamalai sent a letter appreciating actor Dhanush's directorial 'Idli Kadai'.  He highlighted the film's portrayal of youth issues and village culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-celebrates-birthday-in-benares-shares-selfie-with-mirzapur-film-cast-2803452-2025-10-15",
      "headline": "Ali Fazal celebrates birthday in Benares, shares selfie with Mirzapur cast Actor Ali Fazal celebrated his birthday in Benaras with the rest of the cast of the 'Mirzapur' film. He gave fans a glimpse into his birthday celebrations on social media. However, it was a selfie with the entire cast that caught the attention of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/delusion-filming-cancelled-china-tempest-controversy-korean-drama-2803453-2025-10-15",
      "headline": "K-drama Delusion halts China shoot amid Jun Ji Hyun's Tempest backlash 'Delusion' cancels overseas shoot in China for upcoming drama starring Suzy and Kim Seon Ho. Sudden change follows backlash over Jun Ji Hyun's Tempest dialogue in China\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdeva-kapur-shares-tribute-on-his-birth-anniversary-talks-legacy-2803435-2025-10-15",
      "headline": "Sunjay Kapur's wife Priya shares tribute on his birth anniversary, talks legacy Priya Sachdev Kapur penned a heartfelt tribute to her late husband, Sunjay Kapur, on his 54th birth anniversary, recalling his legacy as a devoted family man. Sharing a touching video and verses from the Bhagavad Gita, Priya remembered Sunjay's kindness, strength, and enduring love, saying, \"Some souls don't depart; they expand.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-bombay-high-court-deepfake-videos-protection-2803449-2025-10-15",
      "headline": "Bombay High Court to protect Akshay Kumar against misuse of deepfake videos Bombay High Court is set to grant interim protection to actor Akshay Kumar against misuse of deepfake videos. The court highlights the serious consequences of AI-generated impersonations on public perception and the actor's reputation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/punjab-floods-relief-diljit-dosanjh-joins-kbc-17-support-flood-victims-2803431-2025-10-15",
      "headline": "Diljit Dosanjh to appear on Amitabh Bachchan's KBC 17 to aid Punjab flood victims Diljit Dosanjh will participate in a special episode of 'Kaun Banega Crorepati 17', hosted by Amitabh Bachchan, with his winnings to be donated to Punjab flood victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bomb-threat-ilaiyaraaja-t-nagar-studio-police-investigation-hoax-confirmation-2803430-2025-10-15",
      "headline": "Ilaiyaraaja's T Nagar studio gets bomb threat, search conducted A bomb threat email was sent to Ilaiyaraaja's studio in T Nagar. The Bomb Detection and Disposal Squad conducted a search at his studio and confirmed it as a hoax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-pankaj-dheer-who-played-karn-in-br-chopras-mahabharat-dies-after-cancer-battle-2803437-2025-10-15",
      "headline": "Actor Pankaj Dheer, the iconic Karn of Mahabharat, dies after cancer battle Veteran actor Pankaj Dheer, best known for playing Karna in BR Chopra's iconic 'Mahabharat', died on October 15. The actor had reportedly been battling cancer, which relapsed a few months ago despite undergoing major surgery."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kevin-federline-memoir-alleges-troubling-britney-spears-behaviour-family-concerns-2803432-2025-10-15",
      "headline": "Britney Spears, Kevin Federline clash again as memoir and posts spark drama Kevin Federline's upcoming memoir contains allegations about Britney Spears' behaviour. Britney Spears and her representative respond to claims and media attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhinav-kashyap-questions-salman-khan-playing-a-war-hero-in-battle-of-galwan-2803414-2025-10-15",
      "headline": "Abhinav Kashyap questions Salman Khan playing a war hero in Battle of Galwan Director Abhinav Kashyap reignited his feud with Salman Khan over the actor's role in 'Battle of Galwan'. The clash reflects on the deep personal and professional rifts within the entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pakistan-youth-swipe-right-and-conservatives-lose-sleep-over-lazawal-ishq-2803376-2025-10-15",
      "headline": "Pakistan's youth swipe right and conservatives lose sleep over Lazawal Ishq 'Lazawal Ishq', Pakistan's first online dating show, has sparked a culture clash, pitting a modern, digital generation against old-school morality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-sends-gifts-to-mother-to-be-parineeti-chopra-ahead-of-baby-arrival-2803396-2025-10-15",
      "headline": "Ahead of baby's arrival, Alia Bhatt sends gifts to mother-to-be Parineeti Chopra Actor Alia Bhatt sent a special hamper to her colleague Parineeti Chopra, who is expecting her first child. Parineeti expressed gratitude and excitement on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-agree-to-temporary-48-hour-ceasefire-islamabad-2803626-2025-10-15",
      "headline": "48-hour ceasefire after Pak airstrikes inside Afghanistan kill civiliansPakistan and the Taliban administration in Afghanistan have agreed to a 48-hour ceasefire starting Wednesday evening after fresh border clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/violence-outside-assam-jail-as-zubeen-garg-fans-attack-vehicle-carrying-people-arrested-over-singers-death-2803529-2025-10-15",
      "headline": "Violence outside Assam jail as fans attack those arrested over Zubeen Garg's deathAs police vehicles carrying the accused reached the jail premises, a large crowd demanding justice for Zubeen Garg gathered and began pelting stones at the convoy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-police-twin-suicides-ips-y-puran-kumar-asi-sandeep-corruption-gangster-nexus-bribes-2803416-2025-10-15",
      "headline": "Sex abuse, gangsters, bribes: Twin cop suicides expose rot in Haryana PoliceHaryana Cop Suicide: The saga, which started with the suicide of senior IPS officer Y Puran Kumar, took a new twist this week after an assistant sub-inspector (ASI) allegedly shot himself and blamed the former of corruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-ashley-tellis-arrest-us-advisor-classified-documents-political-row-in-india-2803415-2025-10-15",
      "headline": "Why Ashley Tellis arrest by FBI has sparked political war in IndiaThe arrest of Indian-American geopolitical strategist Ashley Tellis has ignited a fierce political battle in India. He is charged with unlawfully retaining classified US defence documents and meeting with Chinese officials. The BJP alleged that he was part of the \"anti-India\" force and \"celebrated by the Opposition\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/besharm-el-sheikh-the-road-to-hell-paved-with-nobel-intentions-trump-middle-east-pakistan-shehbaz-sharif-2803535-2025-10-15",
      "headline": "Besharm El Sheikh: The Road to Hell Paved With Nobel IntentionsIt is outrageous, immoral and obscene to suggest that Gaza is a gone case, but Gaza is a gone case. Peace comes from justice, not Trump-style razzmatazz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghanistan-pakistan-border-violence-taliban-spin-boldak-ttp-qatar-saudi-arabia-mediation-2803516-2025-10-15",
      "headline": "Pakistan conducts airstrikes inside Afghanistan, kills over a dozen civiliansAfghanistan-Pakistan conflict: The Pakistani Air Force conducted strikes inside Afghanistan in a deadly escalation of the border conflict. An airstrike in Spin Boldak district of Kandahar killed at least 15 civilians, leaving hundreds injured. Taliban fighters hit back, seizing border posts and killing Pakistani soldiers, which made Islamabad dial Qatar and Saudi Arabia for mediation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-anaesthetic-drug-propofol-murder-surgeon-dermatologist-2803509-2025-10-15",
      "headline": "Bengaluru doctor arrested for wife's murder using anaesthetic drug PropofolSix months after a dermatologist's suspicious death in Bengaluru, police arrested her husband, a surgeon, for allegedly killing her using the anaesthetic drug Propofol to make it appear natural."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-releases-second-list-of-candidates-for-bihar-with-12-names-singer-maithli-thakur-to-contest-from-alinagar-2803583-2025-10-15",
      "headline": "BJP's second Bihar list out, singer Maithili Thakur to contest from AlinagarOther key names in the list include Ranjan Kumar from Muzaffarpur — replacing sitting MLA Suresh Sharma — Ram Chandra Prasad from Hayaghat, Subhash Singh from Gopalganj, and Chhoti Kumari from Baniapur. The party has also announced candidates for Chapra, Sonepur, Rosera (SC), Barh, Shahpur, and Agiaon (SC)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-captured-pakistani-tank-post-latest-border-clash-claims-viral-video-2803591-2025-10-15",
      "headline": "Viral video shows Taliban fighter taking away Pak army tankThe video surfaced hours after a fresh round of clashes broke out between Pakistani security forces and Talibani fighters along the border in Khyber Pakhtunkhwa on Tuesday night."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-assembly-bill-hindi-movie-hoardings-ban-language-row-hindi-opposition-mk-stalin-dmk-2803404-2025-10-15",
      "headline": "After backlash, Tamil Nadu to stall anti-Hindi bill banning hoardings, songs, moviesTamil Nadu has decided to stall the anti-Hindi bill following backlash, said sources. The proposed bill sought to ban Hindi  hoardings, movies, abd songs. BJP called it absurd and a political diversion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/durgapur-rape-survivor-father-demands-strict-punishment-accused-says-leaving-bengal-2803614-2025-10-15",
      "headline": "What happened is unbearable, leaving Bengal soon: Durgapur rape survivor's fatherThe father of the Durgapur rape survivor demanded the \"strongest possible punishment\" for the accused and vowed to leave West Bengal as soon as possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/fbi-arrests-ashley-tellis-for-unlawful-retention-of-top-secret-us-documents-2803491-2025-10-15",
      "headline": "FBI's Ashely Tellis Files: Manila envelope, gift bags, dinners with the ChineseCourt records show Ashley Tellis's alleged trail of classified material. Surveillance video reportedly captured him leaving both the State Department and a Defense Department facility after printing reams of restricted files. The FBI also tracked his private meetings with Chinese officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/beyond-the-numbers-the-untold-costs-of-indias-ethanol-breakthrough-2803508-2025-10-15",
      "headline": "Beyond the numbers: The untold costs of India's ethanol breakthroughIndia's ethanol blending program achieved 20% blending in petrol five years ahead of schedule, driving major foreign exchange savings, farmer payouts, and emission cuts, while facing challenges around water use, food security, and vehicle impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/sohan-papdi-diwali-traditional-indian-mithai-heritage-2803444-2025-10-15",
      "headline": "The tragic story of the brilliant Soan PapdiSohan Papdi, once a royal Indian sweet, has become a Diwali meme. This Diwali, it seeks a revival as a symbol of heritage and tradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-pankaj-dheer-who-played-karn-in-br-chopras-mahabharat-dies-after-cancer-battle-2803437-2025-10-15",
      "headline": "Actor Pankaj Dheer, the iconic Karn of Mahabharat, dies after cancer battleVeteran actor Pankaj Dheer, best known for playing Karna in BR Chopra's iconic 'Mahabharat', died on October 15. The actor had reportedly been battling cancer, which relapsed a few months ago despite undergoing major surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-plans-major-layoffs-up-to-15-per-cent-of-hr-staff-and-more-could-be-fired-2803305-2025-10-15",
      "headline": "Amazon plans major layoffs, up to 15% of HR staff and more could be firedAmazon is preparing to cut up to 15 per cent of staff in its HR division as part of a broader AI-driven restructuring. While the exact number of jobs affected is unknown, the Fortune report says other departments are also in the radar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/breaking-the-beat-when-dancers-get-the-bollywood-act-just-right-raghav-juyal-nora-fatehi-shahid-kapoor-2803413-2025-10-15",
      "headline": "Breaking the beat: When dancers get the Bollywood act rightThey started with rhythm in their veins, not scripts in their hands. Today, they're proving that the dance floor can be a gateway to stardom. The story explores how stars like Raghav Juyal, Nora Fatehi, and others have emerged as global icons.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/six-pocket-syndrome-india-kbc-kid-confidence-parenting-entitlement-2802939-2025-10-14",
      "headline": "KBC's viral kid and the six-pocket syndrome: A mirror to modern parentingA KBC contestant's confident interruption has ignited a debate on modern parenting styles in India. Experts link this behaviour to 'Six-Pocket Syndrome,' highlighting the risks of overindulgence and entitlement among children."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-military-crackdown-tlp-protests-punjab-violence-2803357-2025-10-15",
      "headline": "Pakistan's Lal Masjid momentWill the crackdown on the Tehreek-e-Labbaik spark off a new wave of violence? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mr-fafo-survived-2-years-of-gaza-war-but-who-killed-him-amid-peace-hamas-israel-ceasefire-doghmush-2803593-2025-10-15",
      "headline": "Mr Fafo survived 2 years of Gaza war but who killed him amid peace?Gazan influencer Saleh Al-Jafarawi, popular as Mr FAFO, gained millions of followers because of his ground reporting of the Gaza war. He survived the two-year war but was killed after the ceasefire. What led to the killing of Mr FAFO?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/diwali-fashion-gen-z-ananya-panday-micro-blouse-suhana-khan-belted-saree-2802380-2025-10-15",
      "headline": "Diwali fashion, the Gen Z wayFashion designer Manish Malhotra's annual Diwali bash gave a glimpse into Gen Z's love for bold and edgy fashion game for the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-election-live-protests-ticket-bjp-jdu-lalu-tejashwi-yadav-2802833-2025-10-14",
      "headline": "Live: Chirag Paswan's party announces 1st list of 14 candidates for upcoming pollsAs the deadline for nominations nears, the NDA's seat-sharing arithmetic appears increasingly strained, with public unity masking deep internal dissatisfaction. JDU releases the first candidate list today with 57 names. The BJP on Tuesday announced its first list of 71 candidates, including Deputy Chief Ministers Samrat Choudhary and Vijay Sinha. The 243-member Bihar Assembly polls are scheduled for November 6 and 11, with counting on November 14. Follow indiatoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-india-expert-ashley-tellis-arrested-civil-nuclear-deal-modi-government-critic-2803479-2025-10-15",
      "headline": "Ashley Tellis: From helping broker civil nuclear deal to rabid India detractorThe arrest of US foreign policy expert Ashley Tellis marks a stunning fall for a man once hailed as one of the key architects of the India-US nuclear deal. In recent years, Tellis has been one of the sharpest critics of the Narendra Modi-led government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdeva-kapur-shares-tribute-on-his-birth-anniversary-talks-legacy-2803435-2025-10-15",
      "headline": "Sunjay Kapur's wife Priya shares tribute on his birth anniversary, talks legacyPriya Sachdev Kapur penned a heartfelt tribute to her late husband, Sunjay Kapur, on his 54th birth anniversary, recalling his legacy as a devoted family man. Sharing a touching video and verses from the Bhagavad Gita, Priya remembered Sunjay's kindness, strength, and enduring love, saying, \"Some souls don't depart; they expand.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ganesh-malvika-sharma-new-romantic-family-drama-mysuru-kerala-shoots-2803578-2025-10-15",
      "headline": "Malvika Sharma set for Kannada debut with Ganesh's upcoming film: ReportsMalvika Sharma is reportedly set to make her Kannada debut opposite Ganesh in Srinivas Raju's upcoming romantic family drama, which is eyeing an early 2026 release.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakhi-sawant-husband-fir-quashed-divorce-proceedings-2803555-2025-10-15",
      "headline": "Rakhi Sawant, husband quash FIRs against each other; divorce proceedings soonThe Bombay High Court has quashed FIRs filed by Rakhi Sawant and her husband, Adil Durrani, amid their marital discord. The couple will now proceed with divorce, having agreed to settle their disputes amicably."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-announces-zimbabwe-tour-squads-rashid-khan-rested-test-t20is-2803612-2025-10-15",
      "headline": "Rashid Khan rested for One-off Test as Afghanistan name squads for Zimbabwe tour ZIM vs AFG: Rashid Khan has been rested for the one-off Test series against Zimbabwe. Zia Ur Rahman Sharifi, Sharafuddin Ashraf and Khalil Gurbaz have been called up. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-valuation-drops-2025-media-rights-merger-gaming-ad-ban-2803600-2025-10-15",
      "headline": "Has the Indian Premier League peaked? IPL ecosystem valuation falls for a second year IPL valuation has declined for the second year in a row, falling to INR 76,100 crore in 2025. The merger of media rights and ban on gaming ads have significantly impacted the league's revenue streams and growth prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-advice-on-suryakumar-yadav-poor-form-2803581-2025-10-15",
      "headline": "Greedy Suryakumar needs mindset shift to come out of poor form: AB de Villiers AB de Villiers offers candid advice to India's Suryakumar Yadav, emphasising the need for a mental adjustment amid the batter's ongoing struggles in T20 internationals. Suryakumar Yadav's batting form has taken a major hit ever since he was appointed India's T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-salute-team-bus-video-viral-reaction-ind-vs-aus-2803592-2025-10-15",
      "headline": "Watch: Rohit Sharma greets Virat Kohli with salute, shares a hug in team bus India tour of Australia: Rohit Sharma was seen greeting Virat Kohli with a salute as the former captain boarded the team bus in New Delhi ahead of their flight to Australia. Rohit and Kohli will return to competitive action for the first time since the IPL 2025 season during the ODI series, which begins on 19 October in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/six-kings-slam-2025-riyadh-tennis-star-lineup-prize-money-novak-djokovic-2803584-2025-10-15",
      "headline": "Six Kings Slam 2025: Prize money, schedule and all you need to know Novak Djokovic, Carlos Alcaraz, Jannik Sinner and other stars will be in action in the Six Kings Slam, starting Wednesday, October 15 in Riyadh, Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-career-best-icc-test-bowling-ranking-west-indies-series-2803538-2025-10-15",
      "headline": "Kuldeep attains career-best Test rankings after stellar show against West Indies Kuldeep Yadav achieved his career-best 14th spot in ICC Test bowling rankings after a dominant show against the West Indies. Yashasvi Jaiswal also climbed to fifth spot in the batting rankings after his magnificent century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-meets-virat-kohli-rohit-sharma-depart-australia-white-ball-tour-2803522-2025-10-15",
      "headline": "Shubman Gill hugs it out with Rohit Sharma as India travel to Australia: Watch Shubman Gill met Virat Kohli and Rohit Sharma as Team India departed for Australia for the upcoming white-ball tour starting later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sahaja-yamalapalli-stuns-sloane-stephens-wta-tampico-upset-us-open-2803518-2025-10-15",
      "headline": "India's Sahaja Yamalapalli stuns ex-US Open champion in Abierto Tampico Open Sahaja Yamalapalli stunned former US Open champion Sloane Stephens 6-2, 6-2 in a commanding first-round win at the WTA 125K Abierto Tampico in Mexico. The 24-year-old took only an hour to win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-lahore-score-noman-ali-dewald-brevis-2803493-2025-10-15",
      "headline": "Lahore Test: Pakistan hammer world champions to begin new WTC cycle in style PAK vs SA, 1st Test: Noman Ali's 10-wicket haul and a gritty batting effort in the first innings helped Pakistan beat South Africa in the series opener in Lahore. Dewald Brevis's counter-attacking fifty went in vain as the world Test champions fell well short of a 277-run target on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fines-india-slow-over-rate-womens-world-cup-match-vs-australia-2803485-2025-10-15",
      "headline": "Women's World Cup: India fined for slow over-rate against Australia India have been fined five percent of their match fee for maintaining a slow over-rate during their ICC Women's World Cup group-stage match against Australia in Visakhapatnam on Sunday (October 12)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-meets-virat-kohli-rohit-sharma-depart-australia-white-ball-tour-2803522-2025-10-15",
      "headline": "Shubman Gill hugs it out with Rohit Sharma as India travel to Australia: Watch Shubman Gill met Virat Kohli and Rohit Sharma as Team India departed for Australia for the upcoming white-ball tour starting later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sahaja-yamalapalli-stuns-sloane-stephens-wta-tampico-upset-us-open-2803518-2025-10-15",
      "headline": "India's Sahaja Yamalapalli stuns ex-US Open champion in Abierto Tampico Open Sahaja Yamalapalli stunned former US Open champion Sloane Stephens 6-2, 6-2 in a commanding first-round win at the WTA 125K Abierto Tampico in Mexico. The 24-year-old took only an hour to win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-lahore-score-noman-ali-dewald-brevis-2803493-2025-10-15",
      "headline": "Lahore Test: Pakistan hammer world champions to begin new WTC cycle in style PAK vs SA, 1st Test: Noman Ali's 10-wicket haul and a gritty batting effort in the first innings helped Pakistan beat South Africa in the series opener in Lahore. Dewald Brevis's counter-attacking fifty went in vain as the world Test champions fell well short of a 277-run target on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fines-india-slow-over-rate-womens-world-cup-match-vs-australia-2803485-2025-10-15",
      "headline": "Women's World Cup: India fined for slow over-rate against Australia India have been fined five percent of their match fee for maintaining a slow over-rate during their ICC Women's World Cup group-stage match against Australia in Visakhapatnam on Sunday (October 12)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-impact-player-award-delhi-pitch-wickets-west-indies-series-2803475-2025-10-15",
      "headline": "Every wicket felt like a five-wicket haul on difficult Delhi pitch: SirajMohammed Siraj revealed that every wicket he took during the second Test against West Indies in Delhi felt like a five-wicket haul due to the challenges of the surface. Siraj was adjudged Impact Player of the Series after taking ten wickets across two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-tops-icc-odi-bowling-rankings-bangladesh-whitewash-2803472-2025-10-15",
      "headline": "Rashid Khan tops ICC ODI bowling rankings after Bangladesh whitewashAfghanistan leg-spinner Rashid Khan has reclaimed the No. 1 spot in the ICC Men's ODI Bowling Rankings after playing a pivotal role in his team's 3-0 series sweep over Bangladesh in Abu Dhabi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-virat-kohli-india-vs-australia-2803469-2025-10-15",
      "headline": "No Virat Kohli in Pat Cummins combined India-Australia ODI XI. Here's whyAustralia captain Pat Cummins was asked to make an all-time combined India-Australia playing XI. Cummins kept Virat Kohli out of that list. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-no-handshake-troll-deleted-video-glen-maxwell-mitchell-marsh-2803463-2025-10-15",
      "headline": "Watch: Aussie stars mock India's no-handshake stance vs Pakistan in promo videoIndia tour of Australia: A promotional video featuring Australian cricketers has been taken down following backlash over its content, which appeared to mock India's decision to avoid handshakes with Pakistani players during the Asia Cup and the Women's World Cup.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-bcci-musheer-khan-sarfaraz-name-mix-jammu-and-kashmir-vs-mumbai-2803429-2025-10-15",
      "headline": "BCCI slips as scorers mix up Musheer Khan with brother SarfarazRanji Trophy 2025-26: The BCCI reportedly mixed up Sarfaraz Khan and his brother Musheer's names on the opening day of Mumbai's away game against Jammu & Kashmir in Srinagar. The scorecard initially showed Sarfaraz as being dismissed for a duck after opening the batting, but it was actually his brother who fell early on Day 1 of the contest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-india-vs-australia-last-chance-virat-kohli-rohit-aussie-public-2803418-2025-10-15",
      "headline": "Might be the last chance for Australian public to see Rohit-Kohli: Pat CumminsAustralia captain Pat Cummins has called the upcoming ODI series against India a special occasion, suggesting it might be the last opportunity for fans in Australia to witness Virat Kohli and Rohit Sharma in action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-prithvi-shaw-maharashtra-vs-kerala-2803356-2025-10-15",
      "headline": "Prithvi Shaw out for duck as Maharashtra suffer horror start in Ranji TrophyRanji Trophy: Maharashtra suffered a horror start on the opening day of the tournament. Four of their batters fell to ducks inside the first 4 overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-bcci-musheer-khan-sarfaraz-name-mix-jammu-and-kashmir-vs-mumbai-2803429-2025-10-15",
      "headline": "BCCI slips as scorers mix up Musheer Khan with brother SarfarazRanji Trophy 2025-26: The BCCI reportedly mixed up Sarfaraz Khan and his brother Musheer's names on the opening day of Mumbai's away game against Jammu & Kashmir in Srinagar. The scorecard initially showed Sarfaraz as being dismissed for a duck after opening the batting, but it was actually his brother who fell early on Day 1 of the contest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-india-vs-australia-last-chance-virat-kohli-rohit-aussie-public-2803418-2025-10-15",
      "headline": "Might be the last chance for Australian public to see Rohit-Kohli: Pat CumminsAustralia captain Pat Cummins has called the upcoming ODI series against India a special occasion, suggesting it might be the last opportunity for fans in Australia to witness Virat Kohli and Rohit Sharma in action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-prithvi-shaw-maharashtra-vs-kerala-2803356-2025-10-15",
      "headline": "Prithvi Shaw out for duck as Maharashtra suffer horror start in Ranji TrophyRanji Trophy: Maharashtra suffered a horror start on the opening day of the tournament. Four of their batters fell to ducks inside the first 4 overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/portugal-vs-hungary-fifa-world-cup-2026-qualifier-ronaldo-goals-record-2803350-2025-10-15",
      "headline": "Ronaldo breaks record but Hungary deny Portugal early World Cup qualificationCristiano Ronaldo set a new record for World Cup qualifying goals, but Hungary secured a late 2-2 draw, preventing Portugal from clinching a spot in next summer's tournament with two games remaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-india-test-venues-2803346-2025-10-15",
      "headline": "Don't call it a home Test just because the venue is on Indian map: AshwinRavinchandran Ashwin has called for fixed Test centres in India. Ashwin on his YouTube channel said that it made no sense to not have home advantage despite playing in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-ashes-worst-team-since-2010-england-great-stuart-broad-2803337-2025-10-15",
      "headline": "Australia heading into Ashes with their worst team since 2010: Stuart BroadFormer England pacer Stuart Broad believes Australia are heading into this winter's Ashes with its 'worst' team since 2010. Broad was responding to former Australia opener David Warner's prediction that England would lose the series 4-0 down under."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/messi-surpasses-neymar-become-player-most-assists-international-football-2803324-2025-10-15",
      "headline": "Messi becomes player with most assists in international footballLionel Messi broke Neymar's world record to become the player with the most assists in international football. Overall, Messi now has 397 assists across 1,129 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-team-mahakaleshwar-temple-world-cup-losses-2803319-2025-10-15",
      "headline": "India women's team visits Mahakaleshwar Temple after twin World Cup lossesThe Indian women's cricket team visited Ujjain's Mahakaleshwar Temple to seek blessings after consecutive three-wicket losses in their home World Cup campaign. India will aim to keep their semifinal hopes alive when they face England in Indore on October 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-rohit-sharma-leave-for-australia-odis-with-indian-team-2803306-2025-10-15",
      "headline": "Watch: Indian team leaves for Australia for white-ball seriesThe Indian cricket team left for Australia on October 15. Rohit Sharma and Virat Kohli accompanied the team at Delhi's IGI airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-5-key-pointers-2803298-2025-10-15",
      "headline": "Five key takeaways after India's 2-0 series win over the West IndiesIndia completed a 2-0 series sweep against West Indies showcasing emerging young players. The series highlighted key transition points and challenges in team strategy and player management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-kuldeep-yadav-shane-warne-india-ashwin-retirement-spin-bowling-2803234-2025-10-15",
      "headline": "Inspired by Shane Warne's wizardry, Kuldeep Yadav proves his worth in whitesKuldeep Yadav is finally receiving the consistent run in the Indian Test team that he has long deserved, after years of sporadic appearances. Through patience and relentless work on his craft—drawing inspiration from Shane Warne—he is poised to carry forward India's rich spin legacy following R. Ashwin's retirement."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}