{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-from-gold-etfs-to-sgbs-5-smart-ways-to-invest-in-gold-sovereign-gold-bonds-gold-futures-and-options-2804641-2025-10-17",
      "headline": "Diwali 2025: From ETFs to SGBs, 5 smart ways to invest in goldWith gold prices at record levels this Diwali, many people are rethinking whether to buy jewellery or look at smarter investment routes. From gold ETFs to SGBs, there are safer and more practical ways to invest without worrying about storage or high-making charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/coca-cola-india-ipo-hindustan-coca-cola-beverages-valuation-2804639-2025-10-17",
      "headline": "Coca-Cola eyes $1 billion IPO for Indian bottling arm: ReportThe discussions are still in early stages, and Coca-Cola has not yet appointed bankers for the deal. The listing could take place as early as next year, though details such as timing, structure, and offer size are still being worked out, the report said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-keeping-all-your-money-in-saving-account-may-be-a-costly-mistake-explains-ca-2804612-2025-10-17",
      "headline": "Why keeping all your money in saving account may be a costly mistake, explains CAMany people believe that money parked in a savings account is the safest option. But an expert warns that this habit could quietly drain your wealth over time, especially when inflation eats into low returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-rule-change-2025-what-changes-how-it-affects-you-2804586-2025-10-17",
      "headline": "EPFO rule change: What's new in PF withdrawals and how it affects youConfused about the new EPFO rules? This guide covers every update, from withdrawal limits to pension changes, in one place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-know-gold-and-silver-rates-in-your-city-before-you-buy-gold-price-silver-price-2804579-2025-10-17",
      "headline": "Dhanteras 2025: Know gold and silver rates in your city before you buyDhanteras is a day when many Indian families choose to bring home gold or silver, believing it invites prosperity and good fortune. From jewellery and coins to small utensils, shoppers often plan their purchases in advance. But with prices running high this season, checking the latest rates in your city has become more important than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-planning-to-buy-or-gift-gold-know-the-tax-rules-first-income-tax-on-gold-2804510-2025-10-17",
      "headline": "Diwali 2025: Planning to buy or gift gold? Know the tax rules firstFrom coins to jewellery, gold remains a favourite Diwali buy. However, not everyone realises that certain tax rules apply when you purchase or gift gold. Knowing these in advance can help you avoid unexpected trouble later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-surge-festive-buying-fmcg-shares-diwali-2804505-2025-10-17",
      "headline": "Sensex surges 700 points: What is the stock market rising today?The S&P BSE Sensex jumped 647.53 points to 94,115.19 around 11:30 am, while the NSE Nifty50 gained 182.35 points to trade at 25,767.65. Most broader market indices also advanced, though volatility remained elevated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-just-gold-on-dhanteras-why-you-should-consider-mutual-fund-sip-2804495-2025-10-17",
      "headline": "Buying just gold on Dhanteras? Why you should consider a mutual fund SIPAs Dhanteras's theme shifts from gold to goal-based investing, here is a detailed guide to help investors make smarter, purpose-driven financial choices this festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-record-high-dhanteras-shopping-should-you-buy-bullion-expert-view-2804469-2025-10-17",
      "headline": "Big bullion days: Why are gold and silver reaching record highs every day?In India, the timing for the gold and silver rally could not have been more interesting, as the surge comes just ahead of Dhanteras, when buying gold is considered auspicious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-rs-130000-silver-doubles-safe-investment-festive-season-dhanteras-diwali-2025-2804452-2025-10-17",
      "headline": "Gold at Rs 1.3 lakh, silver doubles: Is it safe to invest this Diwali?With prices soaring to record highs, the question everyone is asking is whether this Diwali is the right time to buy or if investors are chasing a fleeting festive rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-shares-plunge-nearly-5-percent-despite-rise-in-q2-net-profit-heres-why-2804439-2025-10-17",
      "headline": "Wipro shares plunge nearly 5% despite rise in Q2 net profit. Here's whyAt around 9:30 am, Wipro was trading at Rs 242.12 on the NSE, down 4.6%. The Nifty IT index slipped around 1.2%, weighed down by losses in both Wipro and Infosys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-above-25550-asian-paints-gains-over-25-2804427-2025-10-17",
      "headline": "Sensex, Nifty open lower amid cautious trade; Asian Paints jumps over 3%At around 9:20 am, the S&P BSE Sensex slipped 112.93 points to 83,354.73, while the NSE Nifty50 was down 42.45 points at 25,542.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-director-kristalina-georgieva-open-india-economy-rise-open-trade-tariff-uncertainty-2804420-2025-10-17",
      "headline": "IMF chief says open trade key for India's continued economic riseIMF Director Kristalina Georgieva said that India stands out as one of the fastest-growing economies in the world and continues to make a major contribution to global growth because of its consistent reform efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/canara-hsbc-life-ipo-listing-today-share-price-gmp-profit-for-investors-buy-review-2804405-2025-10-17",
      "headline": "Canara HSBC Life listing today: What GMP hints about its debut on Dalal StreetThe IPO of Canara HSBC Life Insurance Company Limited was a book-built issue worth Rs 2,517.50 crore. It was entirely an offer-for-sale (OFS) of 23.75 crore shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/azoria-capital-fund-delisting-h1b-visa-controversy-wall-street-retaliation-glbs-2804388-2025-10-17",
      "headline": "Azoria CEO alleges ETF delisted after refusing to back firms hiring H-1B workersAzoria Capital's CEO alleges that his statement -- vowing not to invest in companies that replace American workers with H-1Bs -- led to a sudden move by the Board of Trustees of Tidal Trust III to delist the Azoria 500 Meritocracy ETF, a fund launched earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-2025-date-time-and-everything-investors-must-know-2804174-2025-10-16",
      "headline": "Diwali Muhurat Trading 2025: Date, time and everything investors must knowThis year's Muhurat Trading will take place on Tuesday, October 21, 2025. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-job-here-is-how-much-pf-you-can-withdraw-under-new-epfo-rules-2804170-2025-10-16",
      "headline": "Lost job? Here's how much PF you can withdraw under new EPFO rulesEPFO said the change is meant to safeguard retirement savings while still allowing access during tough times."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb19-episode-55-amaal-apologises-to-farrhana-baseer-and-ashnoor-receive-letters-2804934-2025-10-17",
      "headline": "BB19 episode 55: Amaal apologises to Farrhana; Baseer and Ashnoor receive letters In 'Bigg Boss 19' Episode 55, Amaal apologised to Farrhana after their heated conflict, bringing some relief to the house tensions. Meanwhile, Baseer and Ashnoor received emotional letters from their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-adorably-calls-salman-khan-family-his-own-at-joy-forum-2025-2804925-2025-10-17",
      "headline": "Shah Rukh Khan adorably calls Salman Khan's family his own at Joy Forum 2025 Bollywood's three Khans - Shah Rukh, Salman, and Aamir, came together on the same stage at Joy Forum 2025, entertaining fans with their fun banter and friendly vibes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-iqbal-reacts-to-sonakshi-sinha-jatadhara-trailer-2804917-2025-10-17",
      "headline": "Little devil: Zaheer Iqbal reacts to Sonakshi Sinha's Jatadhara trailer Zaheer Iqbal praised his wife Sonakshi Sinha after watching the trailer of her upcoming supernatural thriller 'Jatadhara', calling her a \"little devil.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-visits-varanasi-attends-ganga-aarti-after-kantara-chapter-1-success-2804897-2025-10-17",
      "headline": "Rishab Shetty visits Varanasi, attends Ganga aarti after Kantara: Chapter 1 success Rishab Shetty visited Varanasi and attended the Ganga aarti to express gratitude for the massive success of 'Kantara: Chapter 1'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-charmer-to-feature-sanya-malhotra-in-a-dreamy-new-avatar-2804888-2025-10-17",
      "headline": "Diljit Dosanjh's Charmer to feature Sanya Malhotra in a dreamy new avatar Sanya Malhotra teams up with Diljit Dosanjh for the music video of his new song 'Charmer' from the album 'Aura'. The stylish teaser still has fans excited to see their on-screen chemistry ahead of the video's release on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zayn-marie-shares-adorable-video-with-father-mansoor-khan-2804880-2025-10-17",
      "headline": "Zayn Marie shares adorable video with father Mansoor Khan: My abbu raising the bar Actor Zayn Marie Khan shared a playful father-daughter video with her filmmaker father, Mansoor Khan, winning hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-reacts-to-farrhanas-bigg-boss-19-gameplay-calls-it-fun-2804854-2025-10-17",
      "headline": "Gauahar Khan reacts to Farrhana's Bigg Boss 19 gameplay, calls it fun Farrhana's bold move to shred Neelam's letter in 'Bigg Boss 19' sparked outrage and emotional clashes among housemates. Actor Gauahar Khan called the episode dramatic yet hilarious, highlighting the intense emotions and chaos inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-is-india-watching-kantara-chapter-1-inside-rishab-shettys-ode-to-faith-fire-2804830-2025-10-17",
      "headline": "Why is India watching Kantara Chapter 1: Inside Rishab Shetty's ode to faith, fire With 'Kantara: Chapter 1', Rishab Shetty shapes rooted cinema for a global audience. The film thrives on faith, community, and the language of emotion beyond words. It's grand, grounded, and glowing -- a reflection of India's enduring belief in home-grown stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pvr-inox-screen-allocation-controversy-ek-deewane-ki-deewaniyat-accuses-favouritism-thamma-2804800-2025-10-17",
      "headline": "Ek Deewane Ki... makers say PVR Inox favouring Thamma, cinema chain denies claim 'Ek Deewane Ki Deewaniyat' makers have accused PVR INOX of favouring 'Thamma' in screen distribution this Diwali. The dispute raises questions about fairness in multiplex film showcasing and may lead to regulatory intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-high-court-screen-malayalam-movie-haal-cbfc-certification-dispute-beef-biryani-row-2804770-2025-10-17",
      "headline": "Kerala High Court to screen Haal amid A certificate, beef biryani row The Kerala High Court will view the Malayalam film 'Haal' during a hearing on a petition contesting the Censor Board's A certificate and suggested edits. The court's decision is expected to impact how sensitive film content is reviewed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jatadhara-trailer-sonakshi-sinha-is-pishachini-in-film-about-black-magic-greed-2804775-2025-10-17",
      "headline": "Jatadhara trailer: Sonakshi Sinha is Pishachini in film about black magic, greed The trailer for supernatural film 'Jatadhara' was released digitally by Mahesh Babu. The film centres on black magic, folklore, and a supernatural being protecting treasure. It stars Sonakshi Sinha, Sudheer Babu, Shilpa Shirodkar and Divya Khossla, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-calls-ed-sheeran-the-nicest-guy-dhee-and-santhosh-narayanan-legends-2804753-2025-10-17",
      "headline": "Hanumankind calls Ed Sheeran the nicest guy, Dhee and Santhosh Narayanan legends Hanumankind recalled how his surprise Coachella encounter with Ed Sheeran has evolved into a dynamic blend of global pop and South Indian sounds on Sheeran's new EP, 'Play'. Their song, 'Don't Look Down', also has Santhosh Narayanan and Dhee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jitendra-kumar-missed-a-golden-chance-to-break-away-from-his-good-guy-image-2804710-2025-10-17",
      "headline": "How Jitendra Kumar missed a golden chance to break away from his good guy image Jitendra Kumar's role in 'Bhagwat Chapter One: Raakshas' was a chance to break his 'good guy' image, but his stereotyped performance and the film's safe treatment kept his villainy from leaving a mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mtv-india-music-channels-shutdown-2025-youth-culture-legacy-2804625-2025-10-17",
      "headline": "Dear MTV, thanks for making us 90s kids feel like pop stars. We will miss you MTV India will shut iconic music channels by the end of 2025. This marks the end of an era that shaped youth culture, fashion, and music discovery in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/our-fault-movie-review-nicole-wallas-gabriel-guevara-prime-video-2804667-2025-10-17",
      "headline": "Our Fault review: Noah and Nick find happy ending, but at what cost?Release Date:Thu Oct 16, 2025 Starring Nicole Wallas and Gabriel Guevara, 'Our Fault' is now streaming on Prime Video. Is the final film in the three-part movie series worth your time? Find out here. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-film-festival-pvr-inox-celebrates-iconic-movies-india-2804692-2025-10-17",
      "headline": "PVR INOX celebrates Shah Rukh Khan's birthday with nationwide film festival PVR INOX is celebrating Shah Rukh Khan's birthday with a special two-week film festival across 30 cities, showcasing his iconic movies and cinematic journey. This nostalgic event honours the superstar's enduring connection with audiences, coinciding with his recent National Award win for 'Jawan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-fall-arbaz-patel-admits-friendship-with-dhanashree-verma-was-not-real-2804700-2025-10-17",
      "headline": "Rise & Fall: Arbaz Patel admits friendship with Dhanashree Verma was not real Despite being close friends with 'Rise & Fall', actor Arbaz Patel has now clarified that his connection with choreographer Dhanashree Verma was just for the game. He also shared his thoughts on Arjun Bijlani winning the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-no-elimination-diwali-cheer-for-contestants-2804680-2025-10-17",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: No elimination, Diwali cheer for contestants 'Bigg Boss 19' gears up for a festive Weekend Ka Vaar with no eliminations and Diwali celebrations hosted by Salman Khan. Ayushmann Khurrana, Rashmika Mandanna, and singer Shaan join the episode, while inside the house, Farrhana Bhatt's explosive captaincy move and Amaal Malik's outburst keep the drama alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/telusu-kada-review-siddu-jonnalagadda-rom-com-is-engaging-but-confusing-like-modern-day-love-2804653-2025-10-17",
      "headline": "Telusu Kada review: Siddu's rom-com is engaging but confusing like modern-day loveRelease Date:Fri Oct 17, 2025 'Telusu Kada' is a confident debut from Neerraja Kona, exploring modern love with bold themes and strong performances. While the film engages, its emotional depth and character arcs could have been sharper."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-wont-be-buying-russian-oil-anymore-trump-claims-again-during-white-house-meet-with-ukraines-zelenskyy-glbs-2804937-2025-10-17",
      "headline": "India to stop buying Russian oil, Trump repeats claim during meet with ZelenskyyUS President Donald Trump said India would no longer buy Russian oil, asserting New Delhi had already reduced imports, while reiterating his plan to end the Ukraine war through diplomacy and tariffs.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistani-military-conducts-airstrikes-on-afghanistan-amid-extended-ceasefire-houses-hit-tolonews-2804905-2025-10-17",
      "headline": "Pak launches airstrikes on Afghanistan again, Taliban say truce overThe strikes came on a day when a Pakistani delegation had already arrived in Doha, Qatar's capital, while the Afghan delegation was expected to join them on Saturday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/belgian-court-approves-extradition-of-fugitive-diamantaire-mehul-choksi-to-india-says-his-arrest-is-valid-2804889-2025-10-17",
      "headline": "Belgian court approves Mehul Choksi's extradition to India, says arrest validMehul Choksi was arrested by Antwerp police on April 11, 2025, following a formal request from Indian authorities. He has been lodged in a Belgian prison since then, with his multiple bail pleas rejected on grounds that he posed a flight risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistans-khawaja-asif-says-all-afghans-must-return-home-our-land-is-for-250-million-pakistanis-glbs-2804943-2025-10-18",
      "headline": "All Afghans must return home, our land is for 250 million Pakistanis: Khawaja AsifPakistan's Defence Minister Khawaja Asif said all Afghans must return home, declaring Pakistan's resources are for its own citizens, accusing Kabul of aiding terrorists and acting as a \"proxy\" for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/elections-hit-by-inflation-democracy-in-danger-2804673-2025-10-17",
      "headline": "Elections Hit by Inflation, Democracy in DangerCorruption is a feature, not a bug of the system of democracy. But reasonable restrictions must apply to prevent it from becoming an out and out kleptocracy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-drops-f-bomb-on-live-tv-during-high-stakes-white-house-meet-with-zelenskyy-glbs-2804944-2025-10-18",
      "headline": "Trump drops F-bomb on live TV during high-stakes White House meet with ZelenskyyPresident Donald Trump dropped an F-bomb live during a White House meeting with Zelenskyy, saying Venezuelan leader Maduro \"doesn't want to f*** around with the US before abruptly ending the presser."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/diplomatic-row-as-india-says-3-bangladeshi-smugglers-killed-local-then-killed-2804822-2025-10-17",
      "headline": "3 Bangladeshis killed in Tripura after attacking locals, Delhi-Dhaka row eruptsDismissing Bangladesh's 'human rights violation' narrative, India stated that the incident occurred three kilometres inside Indian territory, where the illegal immigrants attempted to steal cattle from Bidyabil village. When confronted by locals, they attacked with sharp weapons, prompting the locals to defend themselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uks-prince-andrew-drops-duke-of-york-title-after-epstein-fallout-spy-scandal-glbs-2804945-2025-10-18",
      "headline": "UK's Prince Andrew drops 'Duke of York' title after Epstein fallout, spy scandalPrince Andrew renounced his Duke of York title with King Charles's approval, saying accusations over his Epstein ties distract the monarchy. He remains a prince but will no longer use royal honours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/rss-priyank-kharge-row-helped-congress-1984-elections-indira-rajiv-gandhi-priyank-kharge-ban-bjp-2804358-2025-10-17",
      "headline": "Liquor baron, secret meetings: When RSS ignored BJP, helped Congress win electionAfter Indira Gandhi's assassination, Rajiv Gandhi reportedly had a secret meeting with then RSS chief Balasaheb Deoras, resulting in its cadre supporting the Congress in the 1984 Lok Sabha elections despite the BJP's presence. There were at least six secret meetings between Sangh members and the party, including one at the residence of liquor baron Kapil Mohan. The Congress registered the biggest-ever Lok Sabha election victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-compliments-zelenskyys-stylish-jacket-at-white-house-says-he-looks-beautiful-glbs-2804946-2025-10-18",
      "headline": "He looks beautiful: Trump compliments Zelenskyy's stylish jacket at White HousePresident Trump praised Zelenskyy's stylish jacket at the White House before discussing a potential drone-for-missile deal, saying the US won't give up weapons it needs to protect itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/fake-voter-list-with-names-of-samantha-prabhu-tamannaah-bhatia-emerge-case-filed-hyderabad-bypoll-2804926-2025-10-17",
      "headline": "Fake voter list with names of Samantha Prabhu, Tamannaah Bhatia emerge, case filedA fake voter list featuring the names of some of the top south actors has gone viral. Officials confirmed that the viral entries were fabricated using doctored images."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/vande-bharat-staff-clash-with-dustbins-belts-delhi-nizamuddin-fight-video-viral-battle-of-baghpat-2-2804817-2025-10-17",
      "headline": "Battle of Baghpat 2.0: Vande Bharat staff clash with dustbins, belts in DelhiIn the incident that occurred on Friday, a group of IRCTC employees were seen hurling dustbins, swinging belts and trading blows on the platform in full public view."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/leicester-sikh-community-mourns-joginder-singh-fatal-collision-council-road-sweeper-2804936-2025-10-18",
      "headline": "Elderly Indian-origin Sikh man dies after road-sweeper vehicle hits him in UKAn elderly British Sikh man died after being struck by a council road-sweeper vehicle near a Leicester gurdwara. Police are investigating the incident, which has caused shock and grief in the local Sikh community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/exclusive-its-a-peoples-win-says-hyderabad-doctor-behind-ors-label-ban-fssai-directive-2804642-2025-10-17",
      "headline": "Exclusive: It's a people's win, says Hyderabad doctor behind ORS label banIndia's food regulator issued a ban on using 'ORS' label for sugary drinks after an eight-year campaign by a Hyderabad paediatrician. Dr. Sivaranjani Santosh calls it a \"people's win.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-claims-her-constituency-being-filled-by-outsiders-draws-bjps-ire-2804941-2025-10-18",
      "headline": "Mamata Banerjee claims her constituency being filled by outsiders, draws BJP's ireWest Bengal Chief Minister Mamata Banerjee on Friday clarified her remarks on \"outsiders\" in her Bhowanipore assembly constituency, stressing that her comments were about electoral manipulation, not targeting any community or language group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-is-india-watching-kantara-chapter-1-inside-rishab-shettys-ode-to-faith-fire-2804830-2025-10-17",
      "headline": "Why is India watching Kantara Chapter 1: Inside Rishab Shetty's ode to faith, fireWith 'Kantara: Chapter 1', Rishab Shetty shapes rooted cinema for a global audience. The film thrives on faith, community, and the language of emotion beyond words. It's grand, grounded, and glowing -- a reflection of India's enduring belief in home-grown stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/deleted-to-avoid-distraction-achievements-cited-are-factual-karnataka-minister-on-cms-world-record-post-2804886-2025-10-17",
      "headline": "Deleted to avoid distraction: Minister on Siddaramaiah's 'world record' postThe clarification came after users flagged that the \"London Book of World Records\" company had been dissolved in the UK, prompting a community note on X and criticism from the opposition Janata Dal (Secular)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-raj-thackeray-deepotsav-event-mumbai-shivaji-park-alliance-bmc-polls-2804910-2025-10-17",
      "headline": "Thackeray cousins light up Shivaji Park: Diwali reunion sparks alliance buzzUddhav and Raj Thackeray came together on Friday at Mumbai's Shivaji Park for the MNS 'Deepotsav' event, marking their most prominent joint public appearance yet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/portfolios-allocated-to-25-gujarat-ministers-after-big-cabinet-reshuffle-rivaba-jadeja-gets-education-2804865-2025-10-17",
      "headline": "25 Gujarat ministers get portfolios after rejig, Rivaba Jadeja gets adult educationWhile Deputy Chief Minister Harsh Sanghavi retained the key Home Ministry, Ravindra Jadega's wife, Rivaba Jadeja, was named as  Primary, Secondary and Adult Education Minister. Sanghavi received Police, Housing, Jail, Border Security, and other portfolios, while Kanubhai Patel retained Finance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mtv-india-music-channels-shutdown-2025-youth-culture-legacy-2804625-2025-10-17",
      "headline": "Dear MTV, thanks for making us 90s kids feel like pop stars. We will miss youMTV India will shut iconic music channels by the end of 2025. This marks the end of an era that shaped youth culture, fashion, and music discovery in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-egypts-foreign-minister-in-delhi-praises-president-sisis-role-in-gaza-truce-deal-2804784-2025-10-17",
      "headline": "PM meets Egypt Foreign Minister in Delhi, praises Sisi's role in Gaza truce dealPM Modi highlighted progress in India-Egypt cooperation across trade, technology, energy, defence, and people-to-people ties. He had been invited to the Gaza Peace Summit in Sharm El Sheikh but did not attend; India was represented by Minister of State Kirti Vardhan Singh instead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/what-super-secret-peace-bridge-why-russia-given-jfk-files-to-us-kennedy-khrushchev-siberia-trump-putin-2804602-2025-10-17",
      "headline": "Russia gives US super-secret JFK files with map that could shake up worldRussia has handed over a super-secret Soviet-era file to the US on President JF Kennedy's assassination. The file has a map of a Cold War-era-planned Peace Bridge to connect the two countries. Why did Moscow release the JFK file now, and can it shake up geopolitics?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-adorably-calls-salman-khan-family-his-own-at-joy-forum-2025-2804925-2025-10-17",
      "headline": "Shah Rukh Khan adorably calls Salman Khan's family his own at Joy Forum 2025Bollywood's three Khans - Shah Rukh, Salman, and Aamir, came together on the same stage at Joy Forum 2025, entertaining fans with their fun banter and friendly vibes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-iqbal-reacts-to-sonakshi-sinha-jatadhara-trailer-2804917-2025-10-17",
      "headline": "Little devil: Zaheer Iqbal reacts to Sonakshi Sinha's Jatadhara trailerZaheer Iqbal praised his wife Sonakshi Sinha after watching the trailer of her upcoming supernatural thriller 'Jatadhara', calling her a \"little devil.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-denmark-open-semis-lakshya-sen-exits-2804940-2025-10-17",
      "headline": "Denmark Open: Satwik-Chirag in semi-finals, Lakshya Sen crashes out India's Satwik-Chirag reached the semi-finals of the Denmark Open with a hard-fought win over Indonesia's Rian Ardianto and Rahmat Hidayat. Lakshya Sen crashed out of the tournament in the quarters after a crushing loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-women-cricket-win-sri-lanka-strong-bowling-batting-laura-wolvaardt-2804931-2025-10-17",
      "headline": "South Africa still searching for perfect game: Laura Wolvaardt after Sri Lanka triumph Women's World Cup, SL vs SA: Laura Wolvaardt said that South Africa have a lot to work on despite their crushing 10-wicket win over Sri Lanka on Friday at the R. Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-sri-lanka-vs-south-africa-laura-wolvaardt-colombo-report-2804923-2025-10-17",
      "headline": "South Africa edge closer to semis with clinical 10-wicket win over Sri Lanka Women's World Cup: South Africa defeated Sri Lanka by 10 wickets at the R Premadasa Stadium in Colombo and took a step closer to qualifying for the semis. Nonkululeko Mlaba picked up three wickets while Laura Wolvaardt and Tazmin Brits chipped in with half-centuries. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-new-zealand-vs-pakistan-ben-sawyer-press-conference-2804927-2025-10-17",
      "headline": "New Zealand played some good cricket, but missed out on few moments: Ben Sawyer New Zealand coach Ben Sawyer said that his side has played some good cricket but missed out on a few moments during the competition. New Zealand will face Pakistan and will need a win to keep their top four hopes alive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-historic-bwf-world-junior-championships-medal-badminton-2804902-2025-10-17",
      "headline": "Tanvi Sharma first Indian woman since 2008 to bag World Junior Championships medal Tanvi Sharma defeated Japan's Saki Matsumoto 13-15, 15-9, 15-10 in the quarterfinal and secured India's first medal in the BWF World Junior Championships since 2008. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wta-250-chennai-open-wildcards-sahaja-yamalapalli-maaya-rajeshwaran-2804881-2025-10-17",
      "headline": "Maaya Rajeshwaran, Sahaja Yamalapalli get wildcard entry for Chennai Open Sahaja Yamalapalli and Maaya Rajeshwaran have received wildcard entries for the WTA 250 Chennai Open. Yamalapalli recently made the headlines after beating US Open 2017 champion Sloane Stephens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-virat-kohli-perth-training-full-details-2804873-2025-10-17",
      "headline": "Inside Rohit Sharma and Virat Kohli's Perth training ahead of ODI return India tour of Australia: After taking part in an optional training session just hours after landing in Perth on Thursday, Virat Kohli and Rohit Sharma had extended batting stints on Friday at Optus Stadium. Rohit was also seen engaging in detailed discussions with head coach Gautam Gambhir and captain Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-message-rivaba-jadeja-gujarat-cabinet-minister-2804872-2025-10-17",
      "headline": "Jadeja sends heartfelt message to wife Rivaba after becoming cabinet minister Ravindra Jadeja sent a heartfelt message to his wife Rivaba as she became part of the revamped Gujarat cabinet on Friday, October 17. Rivaba became one of the 25 ministers who were sworn in on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-badoni-five-wicket-haul-delhi-dominate-hyderabad-ranji-trophy-2804871-2025-10-17",
      "headline": "Ayush Badoni shines with five wickets, but Delhi vs Hyderabad clash heads towards draw Ayush Badoni starred for Delhi on Day 3 of the Ranji Trophy clash against Hyderabad, taking a five-wicket haul, keeping Hyderabad under pressure at 400 for seven at the NexGen Cricket Ground in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-odi-series-where-to-watch-rohit-sharma-virat-kohli-comeback-livestreaming-2804870-2025-10-17",
      "headline": "AUS vs IND, 1st ODI in Perth Live-streaming: When and where to watch RoKo's comeback Virat Kohli and Rohit Sharma will return to international cricket for India in the three-match ODI series against Australia starting October 19 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-2027-odi-world-cup-make-a-wish-child-promise-viral-video-aus-vs-ind-odi-2804856-2025-10-17",
      "headline": "Watch: Rohit Sharma makes 2027 World Cup ambitions clear in heartfelt chat with kid While speculations about his ODI future continue, Rohit Sharma reassured fans in a heartwarming interaction with a Make-A-Wish child — a video that quickly went viral. He promised to play in the 2027 World Cup, determined to chase the elusive trophy one last time.rld Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-virat-kohli-perth-training-full-details-2804873-2025-10-17",
      "headline": "Inside Rohit Sharma and Virat Kohli's Perth training ahead of ODI return India tour of Australia: After taking part in an optional training session just hours after landing in Perth on Thursday, Virat Kohli and Rohit Sharma had extended batting stints on Friday at Optus Stadium. Rohit was also seen engaging in detailed discussions with head coach Gautam Gambhir and captain Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-message-rivaba-jadeja-gujarat-cabinet-minister-2804872-2025-10-17",
      "headline": "Jadeja sends heartfelt message to wife Rivaba after becoming cabinet minister Ravindra Jadeja sent a heartfelt message to his wife Rivaba as she became part of the revamped Gujarat cabinet on Friday, October 17. Rivaba became one of the 25 ministers who were sworn in on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-badoni-five-wicket-haul-delhi-dominate-hyderabad-ranji-trophy-2804871-2025-10-17",
      "headline": "Ayush Badoni shines with five wickets, but Delhi vs Hyderabad clash heads towards draw Ayush Badoni starred for Delhi on Day 3 of the Ranji Trophy clash against Hyderabad, taking a five-wicket haul, keeping Hyderabad under pressure at 400 for seven at the NexGen Cricket Ground in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-odi-series-where-to-watch-rohit-sharma-virat-kohli-comeback-livestreaming-2804870-2025-10-17",
      "headline": "AUS vs IND, 1st ODI in Perth Live-streaming: When and where to watch RoKo's comeback Virat Kohli and Rohit Sharma will return to international cricket for India in the three-match ODI series against Australia starting October 19 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-2027-odi-world-cup-make-a-wish-child-promise-viral-video-aus-vs-ind-odi-2804856-2025-10-17",
      "headline": "Watch: Rohit Sharma makes 2027 World Cup ambitions clear in heartfelt chat with kid While speculations about his ODI future continue, Rohit Sharma reassured fans in a heartwarming interaction with a Make-A-Wish child — a video that quickly went viral. He promised to play in the 2027 World Cup, determined to chase the elusive trophy one last time.rld Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shantha-rangaswamy-first-female-president-indian-cricketers-association-inclusive-cricket-governance-2804846-2025-10-17",
      "headline": "Ex-India captain Shantha Rangaswamy named Indian Cricketers Association presidentShantha Rangaswamy, India's first women's cricket captain, has been elected president of the Indian Cricketers' Association (ICA), marking a historic step for female representation in cricket administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-ranji-trophy-fifty-kerala-vs-maharashtra-after-australia-odi-snub-2804845-2025-10-17",
      "headline": "After Australia ODI series snub, Sanju Samson shines on Ranji return for KeralaAfter being snubbed from the Australia ODI series squad, Sanju Samson made a sparkling return to Ranji Trophy with a valiant fifty against Maharashtra. Samson's score helped Kerala recover from a rough spot against Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-rumours-ajit-agarkar-2804832-2025-10-17",
      "headline": "Were Virat and Rohit asked to retire from Tests? Agarkar responds to rumoursAjit Agarkar has set the record straight on Rohit Sharma and Virat Kohli's Test retirements, confirming the decision was entirely theirs. Kohli and Rohit retired from Test cricket before India's tour of England earlier in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajit-agarkar-responds-to-mohammed-shami-india-vs-australia-odi-series-snub-angry-reaction-2804831-2025-10-17",
      "headline": "Ajit Agarkar responds to Mohammed Shami's angry reaction on AUS ODI snubIndia chief selector Ajit Agarkar clarified that Mohammed Shami's exclusion from the ODI squad against Australia was due to fitness concerns. His response came after the pacer publicly questioned the selection panel's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-harmanpreet-kaur-alyssa-healy-womens-world-cup-2025-2804827-2025-10-17",
      "headline": "Time for Harmanpreet Kaur to do an Alyssa Healy in big games: Nasser HussainNasser Hussain has said that Harmanpreet Kaur needs to step up like Alyssa Healy during big games. Harmanpreet has struggled for form in the four matches she has played as India have lost the last two games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-omaima-sohail-new-zealand-vs-pakistan-press-conference-2804825-2025-10-17",
      "headline": "Omaima Sohail urges Pakistan batters to step up in crucial New Zealand clashWomen's World Cup, NZ vs PAK: Omaima Sohail said that Pakistan batters need to step up and put in consistent performances to challenge opponents. On Saturday, Pakistan will be up against New Zealand in their upcoming clash in Colombo on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-womens-cricket-semifinal-chance-new-zealand-press-conference-2804815-2025-10-17",
      "headline": "Pakistan still hopeful of qualifying for Women's World Cup semifinal: Omaima SohailOmaima Sohail said Pakistan still have a chance to reach the Women's World Cup semifinals if they win all three remaining matches, despite currently being last in the standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajit-agarkar-on-rohit-sharma-virat-kohli-trial-bcci-australia-series-2804788-2025-10-17",
      "headline": "Agarkar's massive statement on Rohit Sharma-Virat Kohli ODI futures: Not on trialAjit Agarkar has claimed that Rohit Sharma and Virat Kohli will be assessed but aren't on trial during every match. Rohit and Kohli are set to make their return to international cricket during the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-harmanpreet-kaur-alyssa-healy-womens-world-cup-2025-2804827-2025-10-17",
      "headline": "Time for Harmanpreet Kaur to do an Alyssa Healy in big games: Nasser HussainNasser Hussain has said that Harmanpreet Kaur needs to step up like Alyssa Healy during big games. Harmanpreet has struggled for form in the four matches she has played as India have lost the last two games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-omaima-sohail-new-zealand-vs-pakistan-press-conference-2804825-2025-10-17",
      "headline": "Omaima Sohail urges Pakistan batters to step up in crucial New Zealand clashWomen's World Cup, NZ vs PAK: Omaima Sohail said that Pakistan batters need to step up and put in consistent performances to challenge opponents. On Saturday, Pakistan will be up against New Zealand in their upcoming clash in Colombo on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-womens-cricket-semifinal-chance-new-zealand-press-conference-2804815-2025-10-17",
      "headline": "Pakistan still hopeful of qualifying for Women's World Cup semifinal: Omaima SohailOmaima Sohail said Pakistan still have a chance to reach the Women's World Cup semifinals if they win all three remaining matches, despite currently being last in the standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajit-agarkar-on-rohit-sharma-virat-kohli-trial-bcci-australia-series-2804788-2025-10-17",
      "headline": "Agarkar's massive statement on Rohit Sharma-Virat Kohli ODI futures: Not on trialAjit Agarkar has claimed that Rohit Sharma and Virat Kohli will be assessed but aren't on trial during every match. Rohit and Kohli are set to make their return to international cricket during the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vishmi-gunaratne-injury-update-no-fracture-womens-world-cup-south-africa-2804783-2025-10-17",
      "headline": "Watch: Sri Lanka batter cries in extreme pain after nasty blow against South AfricaWomen's World Cup 2025, SA vs SL: Sri Lanka batter Vishmi Gunaratne was stretchered off after she was struck on her left leg while trying to complete a single. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-new-odi-jersey-odi-series-vs-australia-fans-mixed-response-apollo-tyres-sponsor-logo-2804786-2025-10-17",
      "headline": "India's new ODI jersey with new sponsor logo draws mixed reactions from fansIndia unveiled its new ODI jersey featuring the Apollo Tyres logo ahead of the Perth series. Fans praised the design but criticized the logo size and placement, noting the \"INDIA\" tag sits lower than before."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/martin-odegaard-sidelined-weeks-mcl-injury-arsenal-critical-fixture-2804706-2025-10-17",
      "headline": "Arsenal captain Martin Odegaard out for weeks after fresh injury blowArsenal captain Martin Odegaard faces a lengthy spell on the sidelines with an MCL injury, as confirmed by manager Mikel Arteta. While Odegaard's absence continues, the Gunners receive positive updates on Piero Hincapie and Noni Madueke, who are edging closer to full fitness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-travis-head-chats-with-indias-nitish-reddy-dhruv-jurel-ahead-of-perth-odi-2804761-2025-10-17",
      "headline": "Watch: Travis Head chats with India's Nitish Reddy, Dhruv Jurel ahead of Perth ODIAUS vs IND: Australia star batter Travis Head was seen chatting with India all-rounder Axar Patel and wicketkeeper batter Dhruv Jurel during the photoshoot ahead of the Perth ODI between the two sides."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-coach-phil-simmons-urges-players-to-avoid-social-media-after-fan-abuse-2804752-2025-10-17",
      "headline": "Phil Simmons on Bangladesh team attack at Dhaka airport: No social media for cricketersBangladesh coach Phil Simmons has urged players to stay off social media after the team faced abuse from fans following their 3-0 ODI whitewash against Afghanistan. He also condemned the racial abuse directed at Jaker Ali, calling it \"disgusting\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-adapts-new-role-shubman-gill-captaincy-2025-india-australia-odi-series-2804695-2025-10-17",
      "headline": "India team management should give Rohit room, time in new stint: Pravin AmrePravin Amre calls on the Indian team management to allow Rohit Sharma the freedom to settle into his specialist batting role after his exit as the captain of the team. Rohit will start a new stint as Shubman Gill has taken over as the ODI captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-to-average-150-in-australia-england-to-win-ashes-3-1-steve-harmison-2804668-2025-10-17",
      "headline": "Joe Root to average 150 in Australia, England to win Ashes 3-1: Steve HarmisonEx-England pacer Steve Harmison has thrown his support behind Joe Root to put an end to his barren run of centuries in Australia. Harmison forecasts an outstanding Ashes campaign for the batter, projecting Root to thrive and England to secure a 3-1 series win in the 2025-26 Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-odi-farewell-rafael-nadal-level-madan-lal-urges-bcci-2804688-2025-10-17",
      "headline": "Virat Kohli and Rohit Sharma deserve Rafael Nadal-level farewell: Madan LalWhile India are all ready for their ODI series against Australia, Madan Lal urges the BCCI to give Virat Kohli and Rohit Sharma a farewell akin to Rafael Nadal's, recognising their contributions to Indian cricket."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}