{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zoho-sridhar-vembu-gold-price-warning-systemic-risk-global-economy-2805062-2025-10-18",
      "headline": "Gold flashing a big warning signal: Zoho's Sridhar Vembu says amid rising pricesAs gold prices soar globally, Zoho's Sridhar Vembu raises a red flag. Does the surge signal investor anxiety and eroding trust in the system or reveal a deeper economic fault line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-from-gold-etfs-to-sgbs-5-smart-ways-to-invest-in-gold-sovereign-gold-bonds-gold-futures-and-options-2804641-2025-10-17",
      "headline": "Diwali 2025: From ETFs to SGBs, 5 smart ways to invest in goldWith gold prices at record levels this Diwali, many people are rethinking whether to buy jewellery or look at smarter investment routes. From gold ETFs to SGBs, there are safer and more practical ways to invest without worrying about storage or high-making charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/coca-cola-india-ipo-hindustan-coca-cola-beverages-valuation-2804639-2025-10-17",
      "headline": "Coca-Cola eyes $1 billion IPO for Indian bottling arm: ReportThe discussions are still in early stages, and Coca-Cola has not yet appointed bankers for the deal. The listing could take place as early as next year, though details such as timing, structure, and offer size are still being worked out, the report said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-keeping-all-your-money-in-saving-account-may-be-a-costly-mistake-explains-ca-2804612-2025-10-17",
      "headline": "Why keeping all your money in saving account may be a costly mistake, explains CAMany people believe that money parked in a savings account is the safest option. But an expert warns that this habit could quietly drain your wealth over time, especially when inflation eats into low returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-rule-change-2025-what-changes-how-it-affects-you-2804586-2025-10-17",
      "headline": "EPFO rule change: What's new in PF withdrawals and how it affects youConfused about the new EPFO rules? This guide covers every update, from withdrawal limits to pension changes, in one place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-know-gold-and-silver-rates-in-your-city-before-you-buy-gold-price-silver-price-2804579-2025-10-17",
      "headline": "Dhanteras 2025: Know gold and silver rates in your city before you buyDhanteras is a day when many Indian families choose to bring home gold or silver, believing it invites prosperity and good fortune. From jewellery and coins to small utensils, shoppers often plan their purchases in advance. But with prices running high this season, checking the latest rates in your city has become more important than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-planning-to-buy-or-gift-gold-know-the-tax-rules-first-income-tax-on-gold-2804510-2025-10-17",
      "headline": "Diwali 2025: Planning to buy or gift gold? Know the tax rules firstFrom coins to jewellery, gold remains a favourite Diwali buy. However, not everyone realises that certain tax rules apply when you purchase or gift gold. Knowing these in advance can help you avoid unexpected trouble later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-surge-festive-buying-fmcg-shares-diwali-2804505-2025-10-17",
      "headline": "Sensex surges 700 points: What is the stock market rising today?The S&P BSE Sensex jumped 647.53 points to 94,115.19 around 11:30 am, while the NSE Nifty50 gained 182.35 points to trade at 25,767.65. Most broader market indices also advanced, though volatility remained elevated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-just-gold-on-dhanteras-why-you-should-consider-mutual-fund-sip-2804495-2025-10-17",
      "headline": "Buying just gold on Dhanteras? Why you should consider a mutual fund SIPAs Dhanteras's theme shifts from gold to goal-based investing, here is a detailed guide to help investors make smarter, purpose-driven financial choices this festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-record-high-dhanteras-shopping-should-you-buy-bullion-expert-view-2804469-2025-10-17",
      "headline": "Big bullion days: Why are gold and silver reaching record highs every day?In India, the timing for the gold and silver rally could not have been more interesting, as the surge comes just ahead of Dhanteras, when buying gold is considered auspicious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-rs-130000-silver-doubles-safe-investment-festive-season-dhanteras-diwali-2025-2804452-2025-10-17",
      "headline": "Gold at Rs 1.3 lakh, silver doubles: Is it safe to invest this Diwali?With prices soaring to record highs, the question everyone is asking is whether this Diwali is the right time to buy or if investors are chasing a fleeting festive rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-shares-plunge-nearly-5-percent-despite-rise-in-q2-net-profit-heres-why-2804439-2025-10-17",
      "headline": "Wipro shares plunge nearly 5% despite rise in Q2 net profit. Here's whyAt around 9:30 am, Wipro was trading at Rs 242.12 on the NSE, down 4.6%. The Nifty IT index slipped around 1.2%, weighed down by losses in both Wipro and Infosys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-above-25550-asian-paints-gains-over-25-2804427-2025-10-17",
      "headline": "Sensex, Nifty open lower amid cautious trade; Asian Paints jumps over 3%At around 9:20 am, the S&P BSE Sensex slipped 112.93 points to 83,354.73, while the NSE Nifty50 was down 42.45 points at 25,542.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-director-kristalina-georgieva-open-india-economy-rise-open-trade-tariff-uncertainty-2804420-2025-10-17",
      "headline": "IMF chief says open trade key for India's continued economic riseIMF Director Kristalina Georgieva said that India stands out as one of the fastest-growing economies in the world and continues to make a major contribution to global growth because of its consistent reform efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/canara-hsbc-life-ipo-listing-today-share-price-gmp-profit-for-investors-buy-review-2804405-2025-10-17",
      "headline": "Canara HSBC Life listing today: What GMP hints about its debut on Dalal StreetThe IPO of Canara HSBC Life Insurance Company Limited was a book-built issue worth Rs 2,517.50 crore. It was entirely an offer-for-sale (OFS) of 23.75 crore shares. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dolly-singh-india-first-instagram-golden-ring-award-winner-calls-it-surreal-2805187-2025-10-18",
      "headline": "Dolly Singh becomes first Indian to win Instagram Golden Ring, calls it surreal Actor-influencer Dolly Singh has made history as the first Indian to win Instagram's Global 2025 Rings Award. This milestone recognises her bold creativity and influence on digital culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mahabharat-ek-dharmayudh-an-ai-powered-series-on-india-greatest-mystical-epic-2805160-2025-10-18",
      "headline": "Mahabharat Ek Dharmayudh: An AI powered series on India's greatest mystical epic The AI-powered mystical series 'Mahabharat: Ek Dharmayudh', merges timeless Indian epic storytelling with cutting-edge technology, offering a new immersive viewing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajat-bedi-on-daughter-vera-reaction-to-comparisons-with-kareena-aishwarya-2805135-2025-10-18",
      "headline": "Rajat Bedi on daughter Vera's reaction to comparisons with Kareena, Aishwarya Actor Rajat Bedi's daughter Vera was compared to Kareena Kapoor Khan and Aishwarya Rai Bachchan after her viral appearance at 'The Ba***ds of Bollywood' premiere. He reacted to the unexpected attention on Vera."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kramp-review-kiran-abbavaram-comedy-forgets-sensitivity-logic-humour-2805132-2025-10-18",
      "headline": "K-Ramp review: Kiran Abbavaram's comedy forgets sensitivity, logic, even humourRelease Date:Sat Oct 18, 2025 'K-Ramp' aims to be a loud, full-on comedy with emotional undertones, but it ends up confused, insensitive, and tone-deaf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-headlines-150-crore-chings-action-ad-directed-by-atlee-with-sreeleela-and-bobby-deol-2805126-2025-10-18",
      "headline": "Ranveer Singh, Sreeleela team up in Rs 150 crore ad; Jawan fame Atlee directs Actor Ranveer Singh returns in an action-themed Ching's advert directed by Atlee, co-starring Sreeleela and Bobby Deol. With a reported budget of Rs 150 crore, the campaign surpasses several Bollywood films in scale.   \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-ssura-welcome-daughter-sipaara-celebrate-joyful-fatherhood-mumbai-2805098-2025-10-18",
      "headline": "She'll make you dance: Shabana Azmi's sweet warning to new father Arbaaz Khan Actor Arbaaz Khan and his wife Sshura welcomed their daughter, Sipaara, on October 5. Actor Shabana Azmi congratulated Arbaaz Khan and shared a good-natured warning about fatherhood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/naagin-7-promo-dragon-rivalry-kumbh-ekta-kapoor-new-season-twist-2805082-2025-10-18",
      "headline": "Naagin 7 promo reveals epic Naagin vs Dragon clash at Kumbh The promo for 'Naagin 7' teases a confrontation between a naagin and a dragon at the Kumbh, introducing a new antagonist. The video has attracted mixed reactions, with some viewers criticising its concept and visual style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/daytime-emmy-awards-general-hospital-seven-trophies-2805066-2025-10-18",
      "headline": "52nd Daytime Emmys: David Attenborough becomes oldest winner, see full winners list The 2025 edition of the Daytime Emmy Awards, hosted by Mario Lopez, was held at Pasadena Civic Auditorium, California. 'General Hospital' won seven trophies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pesticide-scandals-inspire-the-india-storry-film-wrap-and-kajal-aggarwals-birthday-wishes-for-sister-nisha-2805049-2025-10-18",
      "headline": "Kajal Aggarwal celebrates sister Nisha's birthday with touching message Actor Kajal Aggarwal posted a touching birthday message for her sister Nisha Aggarwal on Instagram. The actor has completed shooting for 'The India Storry', a film based on true events involving pesticide scandals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rishabh-shetty-struggles-amitabh-bachchan-praises-kantara-performance-kbc-2805034-2025-10-18",
      "headline": "KBC 17: Amitabh Bachchan says Shweta couldn't sleep after watching Kantara Rishabh Shetty recounted his humble beginnings and memorable moments in the film industry. Amitabh Bachchan praised Rishabh's performance in 'Kantara', sharing his daughter's strong reaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-donates-100000-to-support-two-year-old-lilahs-brain-cancer-treatment-2805019-2025-10-18",
      "headline": "Taylor Swift donates $100,000 to young fan battling cancer with heartfelt message Pop sensation Taylor Swift donates USD 100,000 to a two-year-old fan, Lilah, undergoing cancer treatment. The donation came after Lilah's family shared her love for Swift on social media, sparking widespread attention. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-engagement-rumours-thamma-promotions-2805005-2025-10-18",
      "headline": "Rashmika can't stop blushing as she's teased about engagement with Vijay. Watch Actor Rashmika Mandanna reacts to speculation about her engagement with Vijay Deverakonda. The pair's relationship continues to attract attention amid public appearances and online discussions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhojpuri-music-is-back-in-hindi-films-but-is-bollywood-doing-it-dirty-2804824-2025-10-18",
      "headline": "Bhojpuri music is back in Hindi films but is Bollywood doing it dirty? From Panwadi to Aayi Nai, Bhojpuri beats are back in Bollywood. In this week's Cinematic Saturday we discuss if it is a true celebration of regional music or just another catchy imitation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-directorial-debut-praised-by-salman-khan-at-riyadh-joy-forum-2804988-2025-10-18",
      "headline": "Salman praises Aryan Khan's debut, SRK's witty comeback steals the show Salman Khan commends Aryan Khan's directorial debut at Joy Forum in Riyadh. Shah Rukh Khan jokingly comments on Salman's potential future son.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zaira-wasim-announces-marriage-intimate-nikaah-ceremony-photos-2804975-2025-10-18",
      "headline": "Dangal actor Zaira Wasim gets married, shares post with husband Zaira Wasim, who left Bollywood in 2019 for religious reasons, announced her marriage with images from her nikaah ceremony.The former actor, known for her acclaimed roles in 'Dangal' and 'Secret Superstar', posted her first personal update in years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-bigg-boss-19-arc-singing-sensation-anti-hero-2804771-2025-10-18",
      "headline": "From singing sensation to anti-hero: Decoding Amaal Mallik's Bigg Boss 19 arc Singer Amaal Mallik entered 'Bigg Boss 19' with a lot of promise. However, instead of emerging as a hero, his stint in the 'Bigg Boss 19' house has made him an anti-hero. Here's why.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb19-episode-55-amaal-apologises-to-farrhana-baseer-and-ashnoor-receive-letters-2804934-2025-10-17",
      "headline": "BB19 episode 55: Amaal apologises to Farrhana; Baseer and Ashnoor receive letters In 'Bigg Boss 19' Episode 55, Amaal apologised to Farrhana after their heated conflict, bringing some relief to the house tensions. Meanwhile, Baseer and Ashnoor received emotional letters from their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-adorably-calls-salman-khan-family-his-own-at-joy-forum-2025-2804925-2025-10-17",
      "headline": "Shah Rukh Khan adorably calls Salman Khan's family his own at Joy Forum 2025 Bollywood's three Khans - Shah Rukh, Salman, and Aamir, came together on the same stage at Joy Forum 2025, entertaining fans with their fun banter and friendly vibes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zaheer-iqbal-reacts-to-sonakshi-sinha-jatadhara-trailer-2804917-2025-10-17",
      "headline": "Little devil: Zaheer Iqbal reacts to Sonakshi Sinha's Jatadhara trailer Zaheer Iqbal praised his wife Sonakshi Sinha after watching the trailer of her upcoming supernatural thriller 'Jatadhara', calling her a \"little devil.\""
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-warns-india-nuclear-war-taliban-afghanistan-conflict-2805163-2025-10-18",
      "headline": "Taliban snapping at Pak's heels, Asim Munir falls back on anti-India posturingPakistan Army Chief Asim Munir revived anti-India rhetoric at a cadet ceremony even as the military struggles against intensifying Taliban attacks. His remarks are being seen as an attempt to shift focus from the criticism back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/42-percent-bc-reservation-bandh-shuts-down-telangana-protest-high-court-stay-2805148-2025-10-18",
      "headline": "Telangana shuts down over quota protest; shops, petrol pump attacked in HyderabadA bandh called by Backward Classes organisations demanding restoration of 42% reservation in local bodies led to the shutdown of shops, businesses, and transport across Telangana. The protest drew broad political support and left Diwali travellers stranded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-defence-minister-brahmos-missile-first-batch-lucknow-uttar-pradesh-operation-sindoor-pakistan-pahalgam-2805083-2025-10-18",
      "headline": "Every inch within BrahMos range: Rajnath Singh's big warning to PakistanDefence Minister Rajnath Singh on Saturday issued a stark warning to Pakistan, saying every inch of India's neighbour was within the range of BrahMos missiles, even as he called Operation Sindoor merely a trailer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yusuf-pathan-adina-mosque-bengal-malda-controversy-explained-adinath-temple-2805161-2025-10-18",
      "headline": "Yusuf Pathan visits disputed Adina mosque. Why has it stirred a row?Adina mosque row: Recently, former cricketer Yusuf Pathan visited the Adina Mosque in Bengal and called it an architectural marvel. The BJP and social media users pointed out that it was the Adinath temple. What is the dispute all about?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/fire-breaks-out-at-dhakas-hazrat-shahjalal-international-airport-in-bangladesh-all-flights-suspended-2805152-2025-10-18",
      "headline": "Massive fire breaks out at Dhaka airport's cargo terminal, all flights suspendedA fire erupted at the cargo terminal of Dhaka's Hazrat Shahjalal International Airport on Saturday afternoon, leading to the suspension of all flight operations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fire-breaks-out-at-mps-flat-delhi-br-marg-evacuation-injuries-fire-tenders-police-2805088-2025-10-18",
      "headline": "Major fire breaks out at MPs' quarters near Parliament, blame game eruptsA massive fire broke out at Brahmaputra Apartments on BD Marg in Delhi, which houses several Lok Sabha and Rajya Sabha MPs. Fire engines rushed to the spot while the cause of the blaze remains unknown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-diwali-in-himachal-pradesh-village-due-to-centuries-old-curse-2805150-2025-10-18",
      "headline": "No Diwali in Himachal village due to centuries-old 'curse'The villagers in Sammoo, about 25 km from the district headquarters, at the most are allowed to light diyas, but there is a tacit understanding against the bursting of crackers and indulge in extravagance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-selfless-approach-return-aaron-finch-india-vs-australia-odis-2805194-2025-10-18",
      "headline": "Rohit Sharma will remain selfless, has earned the right to play his way: FinchIndia tour of Australia: Former Australia captain Aaron Finch backed Rohit Sharma to continue being fearless with the bat at the top of the order, saying the former captain has earned the right to play his way. Rohit and Virat Kohli will return to international cricket on Sunday in an ODI series in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhojpuri-music-is-back-in-hindi-films-but-is-bollywood-doing-it-dirty-2804824-2025-10-18",
      "headline": "Bhojpuri music is back in Hindi films but is Bollywood doing it dirty?From Panwadi to Aayi Nai, Bhojpuri beats are back in Bollywood. In this week's Cinematic Saturday we discuss if it is a true celebration of regional music or just another catchy imitation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-hungary-donald-trump-meeting-ukraine-war-arrest-warrant-2805058-2025-10-18",
      "headline": "Can Putin reach Hungary to meet Trump without being arrested or shot down?Putin-Trump meeting: While Trump and Putin have decided to meet in Hungary to discuss a possible end to the Ukraine conflict, the million-dollar question is how the Russian leader, who faces an arrest warrant, will reach Budapest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chain-snatching-bengaluru-violent-attack-women-ganesh-festival-arrest-2805144-2025-10-18",
      "headline": "CCTV shows thieves robbing woman, her friend in Bengaluru. They cut her fingersPolice said that the accused fled with a total of 55 grams of gold jewellery looted from the two women, which is valued at an aggregate of around Rs 7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-1st-odi-preview-virat-rohit-comeback-shubman-odi-captaincy-2805093-2025-10-18",
      "headline": "Rohit, Virat back for final dash, ODI captain Gill eyes smooth take-offAustralia vs India, 1st ODI: Virat Kohli and Rohit Sharma will return to Indian colours after seven months as Shubman Gill makes his debut as full-time ODI captain in the first match against Australia in Perth on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kramp-review-kiran-abbavaram-comedy-forgets-sensitivity-logic-humour-2805132-2025-10-18",
      "headline": "K-Ramp review: Kiran Abbavaram's comedy forgets sensitivity, logic, even humourRelease Date:Sat Oct 18, 2025'K-Ramp' aims to be a loud, full-on comedy with emotional undertones, but it ends up confused, insensitive, and tone-deaf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pakistan-afghanistan-conflict-nobel-peace-prize-war-2804971-2025-10-18",
      "headline": "Easy one for me to solve: Trump gloats about resolving Pak-Afghanistan conflictUS President Donald Trump said it would be \"easy\" for him to solve the ongoing Pakistan-Afghanistan conflict, claiming he has already resolved multiple global wars and \"saved millions of lives.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-pm-keir-starmer-eyes-aadhaar-as-model-for-digital-brit-card-id-draws-criticism-illegal-immigration-britain-2804797-2025-10-18",
      "headline": "Aadhaar card for British citizens? PM Starmer plans Brit Card with Indian DNABritish PM Keir Starmer lauded India's Aadhaar digital ID as a \"huge success\" and aims to draw lessons for the UK's own unique ID system. Unlike Aadhaar, Brit Card will not use biometric data and will initially target illegal employment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brave-dog-in-kerala-battles-cobra-to-save-owner-survives-venomous-bite-alappuzha-kerala-2805154-2025-10-18",
      "headline": "Brave dog in Kerala battles cobra to save owner, survives venomous biteA pet dog named Rocky fought off a venomous cobra to protect his owner, Thushara, in Alappuzha, Kerala. The dog killed the snake but was bitten in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-virat-kohli-rohit-sharmas-lives-come-full-circle-in-australia-2805149-2025-10-18",
      "headline": "IND vs AUS: Virat Kohli, Rohit Sharma's lives come full circle in AustraliaRohit Sharma and Virat Kohli have earned a reputation as true match-winners with their remarkable performances in Australia over the years. However, they now return to the country under intense scrutiny, with a new generation of youngsters waiting to step into their shoes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/how-manav-subodhs-1m1b-is-turning-young-indians-into-global-climate-leaders-2804833-2025-10-18",
      "headline": "How Manav Subodh's 1M1B is turning young Indians into global climate leadersManav Subodh built 1M1B (1 Million for 1 Billion) from village pilot phases to a United Nations-linked movement. Now he trains youth in green skills, blends AI and local knowledge, and aims to convert India's youth dividend into climate action to keep global warming below 1.5°C."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/why-commedian-kapil-sharma-kaps-cafe-surrey-canada-attacked-again-lawrence-bishnoi-gangster-salman-khan-goldy-dhillon-2805040-2025-10-18",
      "headline": "Thrice in 4 months: Why Bishnoi gang keeps attacking Kapil Sharma's Canada cafeKapil Sharma's Kap's Cafe in Surrey, Canada, has faced three targeted shootings this year by gangsters from the Lawrence Bishnoi network and Babbar Khalsa. The attacks reflect rising transnational gang violence and extortion threats in Surrey's South Asian community. Here is everything you need to know about the back-to-back attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-boycott-pakistan-tri-series-sri-lanka-taliban-islamabad-conflict-cricketers-die-2804958-2025-10-18",
      "headline": "3 Afghan cricketers killed in Pak air strike, cricket board withdraws from seriesThe Afghanistan Cricket Board (ACB) on Saturday claimed that three domestic cricketers were killed in a Pakistani airstrike in Paktika. In response, the ACB announced the cancellation of a tri-series that was scheduled to be held in Lahore and Rawalpindi in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-534-18-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/exclusive-its-a-peoples-win-says-hyderabad-doctor-behind-ors-label-ban-fssai-directive-2804642-2025-10-17",
      "headline": "Exclusive: It's a people's win, says Hyderabad doctor behind ORS label banIndia's food regulator has barred beverage makers from using the 'ORS' label on sugary drinks, ending an eight-year campaign by Hyderabad paediatrician Dr. Sivaranjani Santosh, who called the move \"a people's win\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/kiran-mazumdar-shaw-unimpressed-with-indigo-gourmet-cuisine-menu-2804994-2025-10-18",
      "headline": "Kiran Mazumdar-Shaw unimpressed with IndiGo's gourmet menu, shares postBiocon chief Kiran Mazumdar-Shaw took a dig at IndiGo Airlines after being served what she called \"tasteless\" in-flight gourmet food. Her post soon sparked an online discussion on the quality of meals offered on domestic flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dolly-singh-india-first-instagram-golden-ring-award-winner-calls-it-surreal-2805187-2025-10-18",
      "headline": "Dolly Singh becomes first Indian to win Instagram Golden Ring, calls it surrealActor-influencer Dolly Singh has made history as the first Indian to win Instagram's Global 2025 Rings Award. This milestone recognises her bold creativity and influence on digital culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mahabharat-ek-dharmayudh-an-ai-powered-series-on-india-greatest-mystical-epic-2805160-2025-10-18",
      "headline": "Mahabharat Ek Dharmayudh: An AI powered series on India's greatest mystical epicThe AI-powered mystical series 'Mahabharat: Ek Dharmayudh', merges timeless Indian epic storytelling with cutting-edge technology, offering a new immersive viewing experience."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-harshit-rana-perth-odi-selection-aakash-chopra-picks-2805205-2025-10-18",
      "headline": "India should pick Harshit Rana for 1st ODI vs Australia: Aakash Chopra Aakash Chopra urged India to play Harshit Rana in the first ODI against Australia in Perth. The young pacer could exploit the bouncy Australian conditions and finally show why selectors have backed him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-deepti-sharma-press-conference-india-vs-england-2805204-2025-10-18",
      "headline": "India just one good game away from bouncing back stronger: Deepti Sharma Women's World Cup, IND vs ENG: Deepti Sharma said that India are more than capable of bouncing back in their game against England after facing back-to-back losses at the hands of South Africa and Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-conflict-afghanistan-boycotts-pak-series-after-airstrikes-pressure-mounts-on-bcci-ytvd-2805201-2025-10-18",
      "headline": "Afghan Cricket Board Quits Pakistan Tri-Series After Airstrikes | Opposition Parties Slam BCCI This special report focuses on the escalating tensions between Pakistan and Afghanistan after alleged Pakistani airstrikes in Paktika province killed civilians, including three domestic cricketers. An opposition leader stated, 'agar reed behen pradhanmantri ho lachar pradhanmantri ho to...atankvad aur khel sath chal sakta hai' (if there is a spineless and helpless Prime Minister...terrorism and sports can go together). The Afghanistan Cricket Board (ACB) has withdrawn from an upcoming T20 tri-series with Pakistan and Sri Lanka in protest, a decision supported by captain Rashid Khan who condemned the attacks as 'barbaric'. This has triggered a political debate in India, with opposition parties questioning the BCCI and the Indian government's policy of playing against Pakistan in multi-nation tournaments, suggesting India should learn from the ACB's decisive stand against terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-batting-preparation-england-spin-attack-womens-world-cup-indore-2805195-2025-10-18",
      "headline": "India have worked as much as possible to negate England spin threat: Deepti Sharma India have intensified their batting practice to counter England's formidable spin attack ahead of the Women's World Cup match. This focused preparation aims to boost India's chances of reaching the semifinals amid tough competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-selfless-approach-return-aaron-finch-india-vs-australia-odis-2805194-2025-10-18",
      "headline": "Rohit Sharma will remain selfless, has earned the right to play his way: Finch India tour of Australia: Former Australia captain Aaron Finch backed Rohit Sharma to continue being fearless with the bat at the top of the order, saying the former captain has earned the right to play his way. Rohit and Virat Kohli will return to international cricket on Sunday in an ODI series in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marc-guehi-leave-crystal-palace-next-year-oliver-glasner-confirms-2805188-2025-10-18",
      "headline": "Real Madrid, Liverpool on alert: Marc Guehi confirmed to leave Crystal Palace in 2026 Crystal Palace boss, Oliver Glasner, revealed that Marc Guehi will not renew with the club and will leave next season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-rain-disrupts-training-ahead-england-clash-2805185-2025-10-18",
      "headline": "Rain washes off India's training session in Indore before England clash Rain disrupted India's preparations ahead of their Women's World Cup clash against England, while the team's campaign has been a mix of wins over Sri Lanka and Pakistan and defeats to South Africa and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-bengal-win-ranji-trophy-response-ajit-agarkar-2805182-2025-10-18",
      "headline": "Mohammed Shami sets up Bengal's big win in Ranji trophy, sends message to Agarkar Mohammed Shami made a strong statement by setting up Bengal's win in the Ranji Trophy with a four-wicket burst against Uttarakhand on Saturday, October 18. Shami also sent a message to Ajit Agarkar before his spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sri-lanka-interpol-red-notice-athletes-fled-2022-commonwealth-games-2805177-2025-10-18",
      "headline": "Sri Lanka to seek Interpol red notices for athletes who fled 2022 Commonwealth Games Sri Lanka will seek Interpol red notices to arrest athletes who fled the 2022 Commonwealth Games in Birmingham and failed to return home, causing a financial loss of about 50 million rupees, officials told a Colombo court on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishad-hossain-favourite-wicket-virat-kohli-big-bash-hobart-hurricanes-champions-trophy-2805171-2025-10-18",
      "headline": "Virat Kohli was my favourite wicket in the Champions Trophy: Rishad Hossain Bangladesh spinner Rishad Hossain said dismissing Virat Kohli in this year's Champions Trophy was his favourite wicket, despite Bangladesh losing the match. Rishad is now set to play for the Hobart Hurricanes in the Big Bash League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-perth-odi-predicted-xi-three-pacers-arshdeep-singh-rohit-sharma-virat-kohli-2805174-2025-10-18",
      "headline": "AUS vs IND, 1st ODI Predicted XI: Will India field 3 pacers ft Arshdeep Singh? AUS vs IND: Shubman Gill begins his ODI captaincy journey by leading his idols, Rohit Sharma and Virat Kohli, in the Perth ODI. India's blend of seasoned icons and emerging stars sets the tone for an exciting series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-rain-disrupts-training-ahead-england-clash-2805185-2025-10-18",
      "headline": "Rain washes off India's training session in Indore before England clash Rain disrupted India's preparations ahead of their Women's World Cup clash against England, while the team's campaign has been a mix of wins over Sri Lanka and Pakistan and defeats to South Africa and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-bengal-win-ranji-trophy-response-ajit-agarkar-2805182-2025-10-18",
      "headline": "Mohammed Shami sets up Bengal's big win in Ranji trophy, sends message to Agarkar Mohammed Shami made a strong statement by setting up Bengal's win in the Ranji Trophy with a four-wicket burst against Uttarakhand on Saturday, October 18. Shami also sent a message to Ajit Agarkar before his spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sri-lanka-interpol-red-notice-athletes-fled-2022-commonwealth-games-2805177-2025-10-18",
      "headline": "Sri Lanka to seek Interpol red notices for athletes who fled 2022 Commonwealth Games Sri Lanka will seek Interpol red notices to arrest athletes who fled the 2022 Commonwealth Games in Birmingham and failed to return home, causing a financial loss of about 50 million rupees, officials told a Colombo court on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishad-hossain-favourite-wicket-virat-kohli-big-bash-hobart-hurricanes-champions-trophy-2805171-2025-10-18",
      "headline": "Virat Kohli was my favourite wicket in the Champions Trophy: Rishad Hossain Bangladesh spinner Rishad Hossain said dismissing Virat Kohli in this year's Champions Trophy was his favourite wicket, despite Bangladesh losing the match. Rishad is now set to play for the Hobart Hurricanes in the Big Bash League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-perth-odi-predicted-xi-three-pacers-arshdeep-singh-rohit-sharma-virat-kohli-2805174-2025-10-18",
      "headline": "AUS vs IND, 1st ODI Predicted XI: Will India field 3 pacers ft Arshdeep Singh? AUS vs IND: Shubman Gill begins his ODI captaincy journey by leading his idols, Rohit Sharma and Virat Kohli, in the Perth ODI. India's blend of seasoned icons and emerging stars sets the tone for an exciting series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/afghan-cricket-board-quits-pak-series-after-airstrikes-opposition-slams-bcci-ytvd-2805173-2025-10-18",
      "headline": "Afghan Cricket Board Quits Pak Series After Airstrikes | Opposition Parties Slam BCCIThis special report focuses on the escalating tensions between Pakistan and Afghanistan following deadly airstrikes in Paktika province, which claimed civilian lives including three domestic cricketers. In response, the Afghanistan Cricket Board (ACB) has withdrawn from an upcoming T20 tri-series involving Pakistan and Sri Lanka, a decision supported by team captain Rashid Khan who condemned the attacks. An Indian opposition leader seized upon the development, stating, 'if the PM is a cowardly PM... terror and sports can go together. Why? Is it because of Amit Shah ji's son?' The leader praised the stance taken by the Afghanistan Cricket Board while criticizing the Indian government and the BCCI's approach to playing cricket with Pakistan. The incident has highlighted the complex intersection of sports and geopolitics in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jharkhand-beat-tamil-nadu-innings-win-114-runs-ishan-kishan-rishav-raj-2805166-2025-10-18",
      "headline": "Ishan Kishan begins Jharkhand captaincy stint with crushing innings win vs Tamil NaduJharkhand secured a commanding innings and 114-run win against Tamil Nadu in the Ranji Trophy Group A match, with Ishan Kishan starring with 173 runs and debutant Rishav Raj taking four wickets. Tamil Nadu struggled with the bat, failing to recover from an early collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-first-odi-shubman-gill-captaincy-rohit-sharma-kohli-dhoni-2805169-2025-10-18",
      "headline": "Shubman Gill admits big shoes for him to fill in as India ODI captainIndia's new ODI captain Shubman Gill admitted that he has big shoes to fill and follow in the footsteps of Rohit Sharma, Virat Kohli and MS Dhoni before him. Gill will start his captaincy tenure with the first ODI between India and Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-manager-arne-slot-backs-florian-wirtz-amid-slow-premier-league-start-2805146-2025-10-18",
      "headline": "Give Florian Wirtz time to adapt to Premier League: Liverpool boss Arne SlotLiverpool manager Arne Slot has publicly supported Florian Wirtz, who has faced scrutiny for his lack of goals and assists in seven Premier League appearances since his high-profile transfer. Slot highlighted the midfielder's adjustment to English football and reaffirmed his belief in Wirtz's potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-virat-kohli-rohit-sharmas-lives-come-full-circle-in-australia-2805149-2025-10-18",
      "headline": "IND vs AUS: Virat Kohli, Rohit Sharma's lives come full circle in AustraliaRohit Sharma and Virat Kohli have earned a reputation as true match-winners with their remarkable performances in Australia over the years. However, they now return to the country under intense scrutiny, with a new generation of youngsters waiting to step into their shoes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-cricket-tribute-paktika-airstrike-victims-zimbabwe-2805151-2025-10-18",
      "headline": "Afghanistan pay homage to Paktika airstrike victims before Zimbabwe TestThe Afghanistan cricket team paid tribute to victims of the Paktika airstrike ahead of their Test against Zimbabwe, expressing solidarity with the bereaved families. In response to the tragedy, Afghanistan also withdrew from the tri-series involving Pakistan and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-leading-run-scorer-aus-vs-ind-odi-series-michael-clarke-2805147-2025-10-18",
      "headline": "Virat Kohli will be leading run-scorer in AUS vs IND ODI series: Michael ClarkeFormer Australia captain Michael Clarke believes Virat Kohli will top the scoring charts in India's upcoming three-match ODI series against Australia. Clarke says Kohli's experience, batting at number three, makes him the frontrunner despite a star-studded lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-downplays-ashes-2025-call-up-focused-on-india-odi-series-2805141-2025-10-18",
      "headline": "Mitchell Marsh laughs off possible Ashes 2025 call-up: Haven't asked my wife yetMitchell Marsh has dismissed talk of a Test cricket comeback ahead of the Ashes 2025 series. His focus remains on leading Australia's limited-overs side against India amid injury concerns in the Test squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-virat-kohli-rohit-sharmas-lives-come-full-circle-in-australia-2805149-2025-10-18",
      "headline": "IND vs AUS: Virat Kohli, Rohit Sharma's lives come full circle in AustraliaRohit Sharma and Virat Kohli have earned a reputation as true match-winners with their remarkable performances in Australia over the years. However, they now return to the country under intense scrutiny, with a new generation of youngsters waiting to step into their shoes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-cricket-tribute-paktika-airstrike-victims-zimbabwe-2805151-2025-10-18",
      "headline": "Afghanistan pay homage to Paktika airstrike victims before Zimbabwe TestThe Afghanistan cricket team paid tribute to victims of the Paktika airstrike ahead of their Test against Zimbabwe, expressing solidarity with the bereaved families. In response to the tragedy, Afghanistan also withdrew from the tri-series involving Pakistan and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-leading-run-scorer-aus-vs-ind-odi-series-michael-clarke-2805147-2025-10-18",
      "headline": "Virat Kohli will be leading run-scorer in AUS vs IND ODI series: Michael ClarkeFormer Australia captain Michael Clarke believes Virat Kohli will top the scoring charts in India's upcoming three-match ODI series against Australia. Clarke says Kohli's experience, batting at number three, makes him the frontrunner despite a star-studded lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-downplays-ashes-2025-call-up-focused-on-india-odi-series-2805141-2025-10-18",
      "headline": "Mitchell Marsh laughs off possible Ashes 2025 call-up: Haven't asked my wife yetMitchell Marsh has dismissed talk of a Test cricket comeback ahead of the Ashes 2025 series. His focus remains on leading Australia's limited-overs side against India amid injury concerns in the Test squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singhs-fighting-160-powers-uttar-pradesh-recovery-ranji-trophy-india-australia-t20i-series-2805131-2025-10-18",
      "headline": "Ahead of AUS vs IND T20Is, Rinku Singh shines with hundred on Ranji Trophy returnRinku Singh's composed 160 rescued Uttar Pradesh from a tough spot against Andhra in the Ranji Trophy. His partnership with Vipraj Nigam and patient approach showcased his growth as a batter ahead of the upcoming T20I series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-new-zealand-1st-t20-rain-abandoned-curran-christchurch-2805133-2025-10-18",
      "headline": "Sam Curran shines but rain abandons series opener in ChristchurchEngland's packed winter schedule began in underwhelming fashion as their first T20 international against New Zealand was abandoned due to persistent rain in Christchurch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-1st-odi-preview-virat-rohit-comeback-shubman-odi-captaincy-2805093-2025-10-18",
      "headline": "Rohit, Virat back for final dash, ODI captain Gill eyes smooth take-offAustralia vs India, 1st ODI: Virat Kohli and Rohit Sharma will return to Indian colours after seven months as Shubman Gill makes his debut as full-time ODI captain in the first match against Australia in Perth on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-appoint-david-saker-as-fast-bowling-coach-ahead-of-ashes-2025-26-2805084-2025-10-18",
      "headline": "England appoint David Saker as fast bowling coach ahead of Ashes 2025-26England has appointed David Saker as fast bowling coach for the 2025-26 Ashes, as Tim Southee is set to exit after 1st Test to play in the ILT20 2025. Saker also previously served as England's fast bowling coach from 2010 to 2015 and for the Ashes 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-tri-nation-t20i-tournament-proceed-despite-afghanistan-withdrawal-2805076-2025-10-18",
      "headline": "Tri-series to go as per schedule despite Afghanistan's pullout: Pakistan BoardPakistan Cricket Board (PCB) have confirmed that the tri-nation T20I series will go as per schedule from November 17 despite Afghanistan pulling out. PCB is actively seeking a replacement team, keeping the event on schedule amid rising tensions with Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-australia-vs-india-odi-series-no-handshake-taunt-promo-no-recollection-2805077-2025-10-18",
      "headline": "AUS vs IND: Mitchell Marsh claims no memory of handshake-promo taunt at IndiaAustralia captain Mitchell Marsh stayed silent on the controversial handshake-promo video targeting India. He chose to focus on cricket as India's legends Kohli and Rohit prepare for their ODI return."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}