{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-tax-on-gold-jewellery-coins-etfs-and-sgbs-explained-2804025-2025-10-16",
      "headline": "Dhanteras 2025: Tax on gold jewellery, coins, ETFs and SGBs explainedGold shopping during Dhanteras is a tradition, but the way your purchase is taxed depends on what you buy. Jewellery, coins, ETFs and Sovereign Gold Bonds all fall under different tax slabs and timelines, making awareness essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-700-points-why-is-stock-market-rising-today-3-reasons-gold-silver-rupee-q2-earnings-trade-deal-us-2803993-2025-10-16",
      "headline": "Sensex jumps 900 points: 3 reasons why stock market is rising todayBy 2:33 pm, the S&P BSE Sensex had climbed 885.28 points to 83,490.71, while the NSE Nifty50 gained 265.25 points to 25,588.80, marking a rise of over 1%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-invest-gold-or-stocks-key-factors-2803992-2025-10-16",
      "headline": "Gold or stocks: Where should investors put their money this Dhanteras?As gold rallies and equities climb, where should your money go this Dhanteras? Experts decode how investors should navigate returns, risk, and diversification to make smarter festival-season decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/nestle-layoffs-16000-job-cuts-globally-over-next-2-years-2803972-2025-10-16",
      "headline": "Nestlé to cut 16,000 jobs globally as new CEO targets sales growthThe decision comes as the company seeks to accelerate its transformation under its new chief executive, Philipp Navratil, who assumed the role in early September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/how-to-invest-in-ipos-primary-market-investing-tips-festive-diwali-picks-2803957-2025-10-16",
      "headline": "Clarity over chaos: What investors can learn this festive seasonThis festive season calls for investors to bring focus and wisdom to their financial decisions, lighting the path within their portfolios with prudence and awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-at-all-time-highs-what-should-buyers-do-this-dhanteras-2803951-2025-10-16",
      "headline": "Gold prices at all-time highs. What should buyers do this Dhanteras?With gold touching historic prices ahead of Dhanteras, shoppers are split between tradition and caution. The surge in rates has raised an important question—should you still buy now or wait?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-climb-again-will-the-rally-continue-till-dhanteras-should-you-buy-avoid-historical-data-2803940-2025-10-16",
      "headline": "Chasing the Gold rally this Dhanteras? Here's why you shouldn't go all inAs Dhanteras approaches, experts urge a cautious approach to gold investment, emphasizing its role as a hedge rather than a growth asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/group-vs-individual-health-insurance-5-things-to-know-2803908-2025-10-16",
      "headline": "Group vs individual health insurance plan: 5 things you must knowGroup insurance seems convenient, but relying solely on it can be risky. Learn why individual health insurance offers continuity, flexibility, and tax advantages, ensuring your coverage remains intact regardless of employment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-income-tax-refunds-have-dropped-16-this-year-2803896-2025-10-16",
      "headline": "Why income tax refunds have dropped 16% this yearAccording to official data from the Central Board of Direct Taxes (CBDT), income tax refunds dropped by about 16% between April and October 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/canara-robeco-amc-lists-5-percent-premium-hold-long-term-reason-explained-2803883-2025-10-16",
      "headline": "Canara Robeco AMC lists at 5% premium: Why long-term investors should stay investedCanara Robeco AMC made a weak market debut, but is it the right long-term pick? Read to know why experts believe strong fundamentals and steady growth make it a hold-worthy investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/playing-it-safe-money-making-you-poorer-personal-finance-tips-expert-explains-linkedin-post-2803870-2025-10-16",
      "headline": "Is 'playing it safe' with your money quietly making you poorer? Experts explainsMany Indians mistake inactivity for safety. But every idle rupee in your bank account loses value each day. Here's why your comfort zone might be quietly costing you wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-tcs-planning-more-job-cuts-here-is-what-the-it-firm-said-2803868-2025-10-16",
      "headline": "Is TCS planning more job cuts? Here's what the IT firm saidAmid speculation over workforce cuts, TCS has given an update on its plans. Speaking at the Q2 earnings call, the HR head shared how the company is approaching staffing and performance reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rubicon-research-share-price-market-debut-nse-bse-28-percent-listing-gains-2803855-2025-10-16",
      "headline": "Rubicon Research makes strong debut, delivers 28% listing gains to investorsThe Rs 1,377.50 crore initial public offering of Rubicon Research received a robust response from investors. The issue was open for subscription between October 9 and October 13 and was subscribed 48 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/canara-robeco-shares-market-debut-bse-nse-5-percent-premium-buy-sell-hold-review-2803843-2025-10-16",
      "headline": "Canara Robeco shares debut at 5% premium: Should you buy?The stock opened at Rs 280.25 per share on both the NSE and BSE, compared to its issue price of Rs 266. This marks a premium of 5.36% on the NSE and 5.66% on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-silver-prices-fall-after-zooming-in-four-months-dhanteras-diwali-wedding-season-india-gold-2803726-2025-10-16",
      "headline": "Will silver prices fall after Diwali? Don't toss a coin, here's the answerSilver prices have doubled in India this year on the back of industrial demand and festive buying. But experts warn of a short-term correction after Diwali, citing overvaluation and investor profit-taking. However, long-term projections on silver remain bullish. Here's what to know before buying silver on Dhanteras 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-293-points-higher-nifty-above-25400-axis-bank-up-3-percent-2803810-2025-10-16",
      "headline": "Sensex opens 293 points higher, Nifty above 25,400; Axis Bank up 3%The S&P BSE Sensex added 350.94 points to 82,956.37, while the NSE Nifty50 gained 83.45 points to 25,407.00, as of 9:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/canara-robeco-ipo-listing-today-share-price-investors-profit-check-gmp-gains-review-2803796-2025-10-16",
      "headline": "Canara Robeco IPO listing today: Will it give investors profit? Check GMPCanara Robeco IPO received an overall subscription of 9.74 times by the close of bidding on October 13, 2025. The IPO allotment was finalised on October 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-apple-manufacturing-india-tax-rules-change-request-diversification-china-away-report-2803787-2025-10-16",
      "headline": "Apple urges India to revise tax rules that may slow its growth: ReportIndia, the world's second-largest mobile market, has become a key focus area for Apple's manufacturing plans. Contract manufacturers such as Foxconn and Tata have already invested billions of dollars to open iPhone plants in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariffs-not-a-matter-of-huge-concern-rbi-chief-downplays-impact-on-india-glbs-2803765-2025-10-16",
      "headline": "US tariffs not a matter of huge concern: RBI chief downplays impact on IndiaRBI Governor Sanjay Malhotra dismissed jitters over US tariffs imposed under Donald Trump, saying India's domestic-driven economy can withstand trade pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-new-rules-myths-and-facts-about-pf-withdrawals-2803660-2025-10-15",
      "headline": "EPFO new rules: Check myths and facts about PF withdrawalsAfter the announcement, social media was flooded with rumours that employees will no longer be able to withdraw their PF after leaving a job. This is not true. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-taj-story-trailer-taj-mahal-contested-history-courtroom-drama-paresh-rawal-2804017-2025-10-16",
      "headline": "The Taj Story trailer: Temple or tomb? Paresh Rawal wants Taj Mahal's DNA test The trailer for 'The Taj Story', featuring Paresh Rawal, was released today. The film examines differing interpretations of the Taj Mahal's history, raising questions about historical narratives and public understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-dheer-passes-away-hema-malini-mourns-veteran-actors-legacy-support-2803973-2025-10-16",
      "headline": "Hema Malini devastated to lose dear friend Pankaj Dheer, shares emotional tribute Hema Malini expressed her grief over Pankaj Dheer's death, remembering his support and friendship. Dheer, known for his role as Karna in 'Mahabharat', died after battling cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kiran-abbavaram-visits-tirumala-tirupati-balaji-temple-ahead-of-k-ramp-release-2803927-2025-10-16",
      "headline": "Actor Kiran Abbavaram seeks blessings at Tirumala temple ahead of K-Ramp release Telugu actor Kiran Abbavaram was seen at Tirupati Balaji temple in Andhra Pradesh ahead of the release of his upcoming Telugu film, 'K-Ramp'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-2-hindi-looks-unstoppable-crosses-rs-150-crore-and-beats-salaar-pushpa-1-2803982-2025-10-16",
      "headline": "Kantara 2 Hindi looks unstoppable, crosses Rs 150 crore and beats Salaar, Pushpa 1 Rishab Shetty's 'Kantara: Chapter 1' continues its stellar run, crossing Rs 150 crore nett in Hindi to become the eighth highest-grossing South dubbed film of all time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjuns-arya-inspired-me-to-write-dude-says-director-keerthiswaran-2803955-2025-10-16",
      "headline": "Allu Arjun's Arya inspired me to write Dude, says director Keerthiswaran At the pre-release event of 'Dude' in Hyderabad, debutant director Keerthiswaran shared that Allu Arjun's 'Arya' was his inspiration to write his film 'Dude'. The Pradeep Ranganathan's film will release in theatres on October 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-zaheer-iqbal-pregnancy-rumours-social-media-diwali-party-2803954-2025-10-16",
      "headline": "Zaheer Iqbal gives playful twist to Sonakshi Sinha's pregnancy rumours. Watch Zaheer Iqbal gave a hilarious twist to his wife Sonakshi Sinha's pregnancy rumours at Ramesh Taurani's Diwali party. The playful interaction led to widespread speculation and discussion on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-mirzapur-film-benaras-shooting-viral-video-2803937-2025-10-16",
      "headline": "Video of Pankaj Tripathi shooting for Mirzapur in Benaras takes internet by storm The videos from the sets of the much-awaited 'Mirzapur: The Film' are taking social media by storm as fans flock to the shooting locations in Benaras. Now, a video of Pankaj Tripathi, aka Kaleen Bhaiya is going viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nobita-vs-dekisugi-rivalry-revives-doraemon-nostalgia-viral-social-media-memes-2803918-2025-10-16",
      "headline": "Nobita vs Dekisugi: Nostalgic anime rivalry sparks global social media trend A playful rivalry between Nobita and Dekisugi from 'Doraemon' goes viral on social media. Fans create memes, videos, and hashtags debating who is better for Shizuka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-posts-children-emotional-tribute-on-sunjay-kapur-birth-anniversary-kareena-kapoor-joins-2803928-2025-10-16",
      "headline": "Karisma posts children's tribute on Sunjay Kapur's birth anniversary, Kareena joins Karisma and Kareena Kapoor remembered late businessman Sunjay Kapur on his birth anniversary with emotional posts, even as his family remains entangled in a Rs 30,000 crore inheritance dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-celebrates-27-years-kuch-kuch-hota-hai-nostalgic-industry-fan-reactions-2803929-2025-10-16",
      "headline": "Karan Johar celebrates 27 years of Kuch Kuch Hota Hai with BTS pics Karan Johar commemorated 27 years since his directorial debut 'Kuch Kuch Hota Hai' with a social media post. The filmmaker shared BTS photos and expressed gratitude for lasting audience support. Karan Johar celebrrated the occaison"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/our-fault-spanish-romance-drama-premieres-globally-prime-video-16-october-2025-2803885-2025-10-16",
      "headline": "Our Fault OTT release: When and where to watch Gabriel Guevara's romance The Spanish romance drama 'Our Fault' debuts on Prime Video on October 16, 2025. The film concludes the Culpables trilogy starring Gabriel Guevara and Nicole Wallace.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-breaks-silence-kyunki-saas-bhi-kabhi-bahu-thi-body-double-controversy-2803878-2025-10-16",
      "headline": "Smriti Irani breaks silence on Kyunki body-double controversy and trolls Smriti Irani has addressed the controversy around the use of a body double in 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot. She dismissed rumours and trolls while reflecting on her acting and political journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kiku-sharda-confirms-great-indian-kapil-show-return-denies-exit-rumours-2803847-2025-10-16",
      "headline": "Kiku Sharda confirms return of The Great Indian Kapil Show, addresses exit rumours Kiku Sharda confirms 'The Great Indian Kapil Show' will resume shooting soon. He denies exit rumours and shares his experience on 'Rise and Fall' and Ashneer Grover reality shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-khalifa-teaser-intense-london-action-onam-release-2803850-2025-10-16",
      "headline": "Khalifa glimpse: Prithviraj Sukumaran looks invincible as Aamir Ali in actioner The first glimpse of 'Khalifa' starring Prithviraj Sukumaran released on his birthday. The promo, titled 'The Bloodline', showcases a stylised London fight sequence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/govinda-reflects-on-career-setbacks-media-scrutiny-and-film-industry-challenges-2803854-2025-10-16",
      "headline": "Govinda gaya: Hero No. 1 star recalls reading articles on his fading stardom Govinda discusses impact of negative media coverage on his career trajectory. Actor explains importance of environment for film success during interview.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tejasswi-prakash-birthday-message-karan-kundrra-anusha-dandekar-infidelity-claims-2803830-2025-10-16",
      "headline": "Did Tejasswi jab boyfriend Karan Kundrra's ex Anusha Dandekar in birthday post? Tejasswi Prakash posted affectionate photos with Karan Kundrra on his birthday, as recent comments by Anusha Dandekar about a former partner's infidelity have reignited public discourse. The post has drawn attention due to ongoing speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/zeeshan-quadri-bigg-boss-19-eviction-reflections-house-controversies-fan-support-2803814-2025-10-16",
      "headline": "Zeishan Quadri on Tanya Mittal's alleged lies on Bigg Boss 19: Who am I to judge? Zeishan Quadri opens up on his eviction from Bigg Boss 19 and his role in house conflicts. He reflects on betrayals, health struggles, and the support he continues to receive from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kevin-federline-memoir-custody-battle-britney-spears-wellbeing-2803803-2025-10-16",
      "headline": "Britney Spears calls ex-husband Kevin's constant gaslighting exhausting, slams him Kevin Federline's upcoming memoir reveals his perspective on his turbulent relationship with Britney Spears and their co-parenting struggles, stirring public responses from Spears herself. The revelations highlight ongoing challenges between the ex-couple and their efforts to protect their children's well-being amidst personal conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-tushaar-stripped-captaincy-indiscipline-2803812-2025-10-16",
      "headline": "Bigg Boss Tamil 9: Tushaar stripped of captaincy Bigg Boss Tamil 9 captaincy was revoked from Tushaar due to his failure to enforce discipline. This move highlights ongoing tensions and rule-breaking among the contestants."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-mallikarjun-kharge-lalu-yadav-call-resolve-seat-sharing-deadlock-mahagathbandhan-bihar-election-2804007-2025-10-16",
      "headline": "Rahul Gandhi dials Lalu Yadav to resolve Bihar seat-sharing deadlock: SourcesRahul Gandhi and Mallikarjun Kharge spoke to RJD supremo Lalu Prasad Yadav to resolve the seat-sharing deadlock in Bihar's Grand Alliance, with nominations for the first phase of polls already underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghanistan-pakistan-war-ceasefire-pakistan-donald-trump-mediation-india-proxy-war-taliban-2804005-2025-10-16",
      "headline": "Wary of Taliban ceasefire, Pak runs to Trump, makes bizarre India claimAfghanistan-Pakistan conflict: As tensions simmer over a fragile ceasefire with the Taliban in Afghanistan, Pakistan has turned to 'peacemaker' Donald Trump to help ease tensions. Will Trump get to solve a ninth conflict soon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-silver-prices-fall-after-zooming-in-four-months-dhanteras-diwali-wedding-season-india-gold-2803726-2025-10-16",
      "headline": "Will silver prices fall after Diwali? Don't toss a coin, here's the answerSilver prices have doubled in India this year on the back of industrial demand and festive buying. But experts warn of a short-term correction after Diwali, citing overvaluation and investor profit-taking. However, long-term projections on silver remain bullish. Here's what to know before buying silver on Dhanteras 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/capt-sabharwal-father-supreme-court-plea-judicial-inquiry-air-india-dreamliner-crash-close-aaib-probe-2803974-2025-10-16",
      "headline": "Air India crash: Pilot's father approaches Supreme Court seeking judicial inquiryThe pilot's father has demanded that all prior investigations conducted by the Aircraft Accident Investigation Bureau (AAIB) be treated as closed and that all material evidence be transferred to a judicially monitored committee or court of inquiry headed by a retired Supreme Court judge, with independent aviation and technical experts as members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-confuses-india-pakistan-new-prime-minister-every-year-mental-health-2803852-2025-10-16",
      "headline": "Every year a new PM: Trump's epic India-Pakistan mix-up goes viralDonald Trump said India was an incredible country and every single year it saw a new leader. However, it is not India, but Pakistan that fits that description perfectly.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-pm-narendra-modi-great-man-praise-dont-want-to-ruin-political-career-2803798-2025-10-16",
      "headline": "He loves me, but don't want to ruin his career: Trump's off-colour Modi jokeDonald Trump's latest praise for Prime Minister Modi came after he claimed that the latter had assured him India would halt oil purchases from Russia, describing it as a significant boost to his efforts to isolate Moscow in the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-jeweller-malabar-gold-and-diamond-boycott-calls-dhanteras-pakistani-influencer-alishba-khalid-controversy-2803981-2025-10-16",
      "headline": "Malabar Gold hit by boycott calls over Pak influencer link ahead of DhanterasJust days before Dhanteras, Kerala-based Malabar Gold & Diamonds has found itself at the centre of a social media storm. The brand is facing renewed boycott calls over its collaboration with Pakistani influencer Alishba Khalid, who, during Operation Sindoor, made anti-India remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-google-ai-deal-andhra-pradesh-dmk-aiadmk-mk-stalin-karnataka-2804011-2025-10-16",
      "headline": "Sundar Pichai picked Andhra despite Tamil origins: AIADMK leader needles StalinAIADMK leader Thangamani criticised the Tamil Nadu government for failing to attract Google investment. \"Despite Google CEO Sundar Pichai being a Tamil, Google has gone to Andhra Pradesh and not Tamil Nadu,\" he said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-blinked-first-in-fight-between-pakistan-taliban-afghanistan-kabul-airstrike-afghan-retaliation-durand-line-2803952-2025-10-16",
      "headline": "Who blinked first, sought truce in the Afghanistan-Pakistan war?Afghanistan and Pakistan fought a brief but deadly war this week that left hundreds dead. Pakistan used fighter jets and drones. A 48-hour ceasefire is now in place. But who blinked first and sought mediation to end the war? Here's what we know amid claims and counterclaims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-caste-survey-sudha-murthy-narayan-murthy-obc-sc-st-siddaramaiah-congress-2803833-2025-10-16",
      "headline": "Narayana Murthy, Sudha Murty opt out of Karnataka caste survey, said thisInfosys founders Narayana Murthy and Sudha Murty opted out of Karnataka's socio-economic survey after the High Court clarified that participation is voluntary. DK Shivakumar said the government will not compel anyone to take part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-kiran-shaw-poor-roads-garbage-dk-shivakumar-bjp-jds-congress-2803866-2025-10-16",
      "headline": "Kiran Shaw's Bengaluru infra callout gets massive public supportBiocon chief Kiran Mazumdar-Shaw's posts on Bengaluru's poor roads and garbage management drew massive online support, including BJP and JD(S) leaders. DK Shivakumar said criticism \"hurts the state.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-china-trade-war-trump-aide-scott-bessent-li-chenggang-wolf-warrior-2803922-2025-10-16",
      "headline": "US calls Chinese trade negotiator Li Chenggang unhinged in rare public attackUS-China trade war: US Treasury Secretary Scott Bessent, in an interview, narrated how the Chinese trade negotiator turned up in Washington recently without any invitation and behaved in an 'unhinged' manner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-man-helps-woman-deliver-baby-on-train-platform-with-doctor-on-video-call-viral-video-vikas-bendre-2803989-2025-10-16",
      "headline": "Mumbai man helps woman deliver baby on train platform with doctor on video callAs the pregnant woman's labour progressed while travelling on a train, Vikas Bendre pulled the emergency chain at Mumbai's Ram Mandir Station when the situation became critical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaisalmer-bus-fire-vehicles-safety-india-record-why-recurring-mennace-reasons-explained-2803590-2025-10-16",
      "headline": "Trapped in flames: Why bus fires make passengers sitting ducksThe Jaisalmer bus fire, which killed 21 people, exposes why India's buses are deathtraps. The reasons are plenty. While flammable interiors, faulty retrofits, trigger spark, jammed exit doors, overcrowding and lax safety norms make burning buses a deadly trap for passengers. Recurring tragedies, like in Maharashtra's Buldhana which killed 25, one in Nashik, claimed 12 lives, demand urgent safety reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/energy-choices-guided-by-consumer-interest-government-on-trumps-claim-that-india-will-stop-russian-oil-buys-2803853-2025-10-16",
      "headline": "Energy choices guided by consumer interest: India on Trump's Russian oil claimThe government on Thursday reaffirmed that India's energy decisions are guided by consumer interests, focusing on stable prices, secure supplies, and diversified sourcing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jnu-scuffle-general-body-meeting-tensions-student-union-elections-2803910-2025-10-16",
      "headline": "ABVP, Left groups clash at JNU over 'derogatory remarks on UP, Bihar students'Clashes erupted between left-wing and right-wing student groups during a JNU General Body Meeting, leaving several injured ahead of next month's student union elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-celebrates-27-years-kuch-kuch-hota-hai-nostalgic-industry-fan-reactions-2803929-2025-10-16",
      "headline": "Karan Johar celebrates 27 years of Kuch Kuch Hota Hai with BTS picsKaran Johar commemorated 27 years since his directorial debut 'Kuch Kuch Hota Hai' with a social media post. The filmmaker shared BTS photos and expressed gratitude for lasting audience support. Karan Johar celebrrated the occaison"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-cryptic-post-twitter-brand-promotional-video-world-cup-2027-2803984-2025-10-16",
      "headline": "Virat Kohli's cryptic X post was teaser to brand promotion, triggers meme festMany fans initially saw Virat Kohli's post as a rare glimpse into his personal thoughts, only to feel let down when it turned out to be a brand promotion. The former captian will return to international cricket on October 19 when India take on Australia in the first of a three-match ODI series in Perth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghans-display-pants-of-pakistan-soldiers-vow-to-join-taliban-mujahideen-fighters-islamabad-2803638-2025-10-15",
      "headline": "Taliban display pants of Pak soldiers, Afghans vow to join MujahideenThough a fragile 48-hour ceasefire has taken hold, the tensions between Afghanistan and Pakistan are boiling after Pakistani airstrikes deep inside Afghan territory killed 15 civilians. Earlier, the Taliban overran Pakistani outposts and seized uniforms and weapons from the abandoned facilities. The trousers were displayed in public in Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/not-just-india-on-henley-passport-index-us-faces-a-setback-too-2803987-2025-10-16",
      "headline": "Not just India, on Henley Passport Index, US faces a setback tooIndia's passport has slipped five places in the Henley Passport Index 2025, now ranking 85th compared to 80th in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/parenting-toddlers/story/snowplow-parenting-urban-india-anxiety-dependence-children-2803884-2025-10-16",
      "headline": "Snowplow parenting syndrome: Why Indian parents won't let kids struggle anymoreSnowplow parenting is increasingly common in urban India, with parents removing obstacles for their children. Experts warn this may harm children's resilience and independence in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/nestle-layoffs-16000-job-cuts-globally-over-next-2-years-2803972-2025-10-16",
      "headline": "Nestlé to cut 16,000 jobs globally as new CEO targets sales growthThe decision comes as the company seeks to accelerate its transformation under its new chief executive, Philipp Navratil, who assumed the role in early September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/our-cooperation-in-energy-very-much-in-tune-russian-envoy-to-india-on-trumps-oil-claim-2803931-2025-10-16",
      "headline": "India-Russia energy ties in sync: Russian envoy on Trump's oil claimRussian envoy Denis Alipov said India's energy cooperation with Moscow aligns with its national interests. Government reiterated that India's import policies prioritise consumer interests and energy security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-telangana-governments-plea-challenging-pause-on-raising-obc-quota-in-local-bodies-2803965-2025-10-16",
      "headline": "Supreme Court rejects Telangana's plea against stay on OBC quota in local bodiesThe Supreme Court dismissed Telangana's plea challenging the High Court stay on 42% BC reservations. The bench said elections should proceed under existing quotas. Arguments on \"deemed assent\" and survey data were rejected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-taj-story-trailer-taj-mahal-contested-history-courtroom-drama-paresh-rawal-2804017-2025-10-16",
      "headline": "The Taj Story trailer: Temple or tomb? Paresh Rawal wants Taj Mahal's DNA testThe trailer for 'The Taj Story', featuring Paresh Rawal, was released today. The film examines differing interpretations of the Taj Mahal's history, raising questions about historical narratives and public understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-dheer-passes-away-hema-malini-mourns-veteran-actors-legacy-support-2803973-2025-10-16",
      "headline": "Hema Malini devastated to lose dear friend Pankaj Dheer, shares emotional tributeHema Malini expressed her grief over Pankaj Dheer's death, remembering his support and friendship. Dheer, known for his role as Karna in 'Mahabharat', died after battling cancer."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-lsg-ipl-2804018-2025-10-16",
      "headline": "End of Williamson's IPL journey? Batter joins LSG as strategic advisor Former New Zealand captain Kane Williamson has joined Lucknow Super Giants as the strategic advisor. Is this the end of Williamson's journey as a player in the IPL?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rory-mcilroy-roger-federer-golf-india-championship-2804014-2025-10-16",
      "headline": "Rory McIlroy's India debut: Inspired by Federer, golfer takes a leap of faith Rory McIlroy has travelled to India for the first time. The legendary golfer is participating in the DP World India Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-golden-boy-not-nominated-explained-rules-fc-barcelona-2804000-2025-10-16",
      "headline": "Why is FC Barcelona's Lamine Yamal not in Golden Boy 2025 shortlist? Explained FC Barcelona and Spain wonderkid Lamine Yamal is not on the Golden Boy 2025 shortlist due to a key rule of the award. His absence is procedural, not a reflection of his talent or recent performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-cryptic-post-twitter-brand-promotional-video-world-cup-2027-2803984-2025-10-16",
      "headline": "Virat Kohli's cryptic X post was teaser to brand promotion, triggers meme fest Many fans initially saw Virat Kohli's post as a rare glimpse into his personal thoughts, only to feel let down when it turned out to be a brand promotion. The former captian will return to international cricket on October 19 when India take on Australia in the first of a three-match ODI series in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/harry-kane-targets-world-cup-redemption-after-penalty-heartbreak-qatar-2022-2803971-2025-10-16",
      "headline": "Harry Kane keen to bury World Cup heartache after penalty miss in Qatar England captain Harry Kane remains driven by the haunting memory of his missed penalty in the 2022 World Cup quarter-final against France — a moment he calls the lowest point of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-tough-challenge-india-vs-australia-odi-series-shane-watson-2803970-2025-10-16",
      "headline": "Virat Kohli, Rohit Sharma set for tough test vs Australia's top bowlers: Watson Shane Watson believes Rohit Sharma and Virat Kohli will face a stern test against Australia's world-class bowlers. Returning to ODIs after months, the Indian duo must quickly rediscover their rhythm to dominate again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-fan-breaches-security-gaddafi-stadium-pakistan-south-africa-test-2803909-2025-10-16",
      "headline": "Babar Azam fan climbs onto stands, walks up to dressing room to meet birthday boy Pakistan vs South Africa: A fan jumped onto one of the stands at Gaddafi Stadium in Lahore and walked up to the Pakistan dressing room in a bid to meet Babar Azam. The star batter was celebrating his 31st birthday on Day 4 of a Test match against the world Test champions in Lahore on Wednesday, October 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-ashes-test-recall-century-queensland-sheffield-form-2803899-2025-10-16",
      "headline": "Marnus Labuschagne continues century spree, pushes his case for Test recall Ashes 2025: Marnus Labuschagne continued his remarkable run of form with his fourth century in five innings for Queensland, further strengthening his case for a recall to Australia's Test side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-commonwealth-games-2030-sport-tournaments-2803887-2025-10-16",
      "headline": "Commonwealth Games: Big events that led to India hosting centenary edition India has been recommended as the host for the Commonwealth Games 2030. What other big events have India hosted in the last 10 years?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/harry-kane-targets-world-cup-redemption-after-penalty-heartbreak-qatar-2022-2803971-2025-10-16",
      "headline": "Harry Kane keen to bury World Cup heartache after penalty miss in Qatar England captain Harry Kane remains driven by the haunting memory of his missed penalty in the 2022 World Cup quarter-final against France — a moment he calls the lowest point of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-tough-challenge-india-vs-australia-odi-series-shane-watson-2803970-2025-10-16",
      "headline": "Virat Kohli, Rohit Sharma set for tough test vs Australia's top bowlers: Watson Shane Watson believes Rohit Sharma and Virat Kohli will face a stern test against Australia's world-class bowlers. Returning to ODIs after months, the Indian duo must quickly rediscover their rhythm to dominate again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-fan-breaches-security-gaddafi-stadium-pakistan-south-africa-test-2803909-2025-10-16",
      "headline": "Babar Azam fan climbs onto stands, walks up to dressing room to meet birthday boy Pakistan vs South Africa: A fan jumped onto one of the stands at Gaddafi Stadium in Lahore and walked up to the Pakistan dressing room in a bid to meet Babar Azam. The star batter was celebrating his 31st birthday on Day 4 of a Test match against the world Test champions in Lahore on Wednesday, October 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-ashes-test-recall-century-queensland-sheffield-form-2803899-2025-10-16",
      "headline": "Marnus Labuschagne continues century spree, pushes his case for Test recall Ashes 2025: Marnus Labuschagne continued his remarkable run of form with his fourth century in five innings for Queensland, further strengthening his case for a recall to Australia's Test side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-commonwealth-games-2030-sport-tournaments-2803887-2025-10-16",
      "headline": "Commonwealth Games: Big events that led to India hosting centenary edition India has been recommended as the host for the Commonwealth Games 2030. What other big events have India hosted in the last 10 years?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jalaj-saxena-ranji-trophy-domestic-cricket-india-snub-salil-ankola-chetan-sharma-2803880-2025-10-16",
      "headline": "Jalaj Saxena never playing for India surprises ex-selectors: You were chairmanFormer India players and selectors Salil Ankola and Chetan Sharma were surprised that veteran Jalaj Saxena had never represented India internationally, despite being one of the most accomplished players in Ranji Trophy history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/kohlis-wont-give-up-message-a-bold-signal-to-selectors-ahead-of-2027-world-cup-ytvd-2803864-2025-10-16",
      "headline": "Kohli's 'Won't Give Up' Message: A Bold Signal To Selectors Ahead Of 2027 World Cup?This special report unpacks the speculation surrounding Virat Kohli's future following his cryptic message ahead of the crucial India vs. Australia ODI series. Key figures discussed include Kohli, Rohit Sharma, and former cricketer Madanlal, amidst talk of the 2027 World Cup. Kohli's post stated, 'The only time you truly fail is when you decide to give up.' The programme explores if this is a signal of his intent to play in the 2027 World Cup, his return to the ODI squad alongside Rohit Sharma after both retired from Test and T20I formats, and the challenges ahead. The discussion also features analysis from former cricketer Madanlal, who believes in clear communication between the selectors and senior players like Kohli, and notes that Kohli will not give selectors a chance to drop him based on performance. The report also addresses the selection pressures under the Ajit Agarkar-led committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-tweet-message-india-vs-australia-odi-2803834-2025-10-16",
      "headline": "Virat Kohli's viral X post before IND vs AUS ODI series turns out to be an adIndia vs Australia: Hours after landing in Australia ahead of his ODI comeback, Virat Kohli's post on X has gone viral among fans. Many are linking the tweet to speculation about his participation in the 2027 ICC ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defends-six-kings-slam-exhibition-tight-tennis-schedule-injury-2803827-2025-10-16",
      "headline": "Carlos Alcaraz defends playing exhibitions amid criticism over gruelling scheduleWorld number one Carlos Alcaraz has defended his participation in the Six Kings Slam exhibition, despite a demanding tennis calendar and a lingering ankle injury. He responded to critics who have questioned players for taking part in exhibition events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rcb-commercial-deal-ipl-2803822-2025-10-16",
      "headline": "Virat Kohli not signing commercial deal with RCB. Is he leaving franchise?Reports floating in the Indian media state that Virat Kohli is yet to sign a commercial deal with RCB ahead of the next IPL season. Does this mean that the batter is leaving the franchise? Or worse, retiring from the game?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-2027-world-cup-preparation-india-cricket-odi-dinesh-karthik-2803813-2025-10-16",
      "headline": "Virat Kohli serious about playing in 2027 World Cup: Karthik drops big hintFormer India wicketkeeper-batter Dinesh Karthik believes Virat Kohli remains fully committed to representing India at the 2027 ICC Men's Cricket World Cup, expressing confidence that the former captain will once again deliver under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-gilchrist-reacts-zak-crawley-england-bazball-claim-australia-ashes-2803800-2025-10-16",
      "headline": "Australia did it 20 years before England: Gilchrist's dig at Bazball ahead of AshesFormer Australia player Adam Gilchrist has responded to Crawley's Bazball claim, emphasising that Australia have been playing the same aggressive brand of cricket for 20 years before England adopted the style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-vs-australia-odi-rohit-sharma-virat-kohli-2803795-2025-10-16",
      "headline": "Shubman Gill's ODI team, Rohit Sharma's DNA: Why fix something that ain't brokenShubman Gill may lead India's one-day international team into the future, but the blueprint is unmistakably Rohit Sharma's. With or without him, the flavour he instilled will ensure as India set their sights on the big prize in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rcb-commercial-deal-ipl-2803822-2025-10-16",
      "headline": "Virat Kohli not signing commercial deal with RCB. Is he leaving franchise?Reports floating in the Indian media state that Virat Kohli is yet to sign a commercial deal with RCB ahead of the next IPL season. Does this mean that the batter is leaving the franchise? Or worse, retiring from the game?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-2027-world-cup-preparation-india-cricket-odi-dinesh-karthik-2803813-2025-10-16",
      "headline": "Virat Kohli serious about playing in 2027 World Cup: Karthik drops big hintFormer India wicketkeeper-batter Dinesh Karthik believes Virat Kohli remains fully committed to representing India at the 2027 ICC Men's Cricket World Cup, expressing confidence that the former captain will once again deliver under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-gilchrist-reacts-zak-crawley-england-bazball-claim-australia-ashes-2803800-2025-10-16",
      "headline": "Australia did it 20 years before England: Gilchrist's dig at Bazball ahead of AshesFormer Australia player Adam Gilchrist has responded to Crawley's Bazball claim, emphasising that Australia have been playing the same aggressive brand of cricket for 20 years before England adopted the style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-vs-australia-odi-rohit-sharma-virat-kohli-2803795-2025-10-16",
      "headline": "Shubman Gill's ODI team, Rohit Sharma's DNA: Why fix something that ain't brokenShubman Gill may lead India's one-day international team into the future, but the blueprint is unmistakably Rohit Sharma's. With or without him, the flavour he instilled will ensure as India set their sights on the big prize in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bhutia-sunil-chhetri-comeback-mistake-indian-football-reform-asian-cup-exit-2803778-2025-10-16",
      "headline": "Sunil Chhetri's comeback was big mistake for Indian football: Bhaichung BhutiaAfter India crashed out of the AFC Asian Cup qualification race following a 2-1 defeat to Singapore in Margao on Tuesday, former India captain Bhaichung Bhutia said that talismanic striker Sunil Chhetri should not have reversed his retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-kohli-india-vs-australia-flight-delay-perth-2803775-2025-10-16",
      "headline": "After multiple hours of flight delay, Indian team arrives late night in PerthThe Indian cricket team arrived in Perth in the early hours of October 16. After multiple hours of delay, a tired Indian team checked into their hotel at 4 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-beat-samoa-nepal-oman-qualify-t20-world-cup-2026-asia-eap-qualifier-2803774-2025-10-16",
      "headline": "UAE inch closer to T20 World Cup after win over Samoa sends Nepal, Oman throughThe UAE will clinch their place at the T20 World Cup on Thursday if they beat Japan in Muscat. Their win over Samoa ensured Nepal and Oman secured their berths for next year's ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-odi-return-invaluable-pure-batter-dinesh-karthik-2803725-2025-10-16",
      "headline": "Fresh and fit Rohit Sharma will be invaluable as a batter, says Dinesh KarthikDinesh Karthik believes that Rohit Sharma may be eyeing that elusive ODI World Cup and will provide invaluable contributions even though he is no longer the captain of the ODI side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-rain-halts-pakistan-win-vs-england-womens-world-cup-2803728-2025-10-15",
      "headline": "Fatima Sana rues Pakistan missing golden chance of historic England win due to rainWomen's World Cup, ENG vs PAK: Pakistan's match against England on Wednesday in Colombo was washed off due to rain. Pakistan got their first point, but stayed at the bottom of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-batting-struggles-rain-halt-womens-world-cup-pakistan-colombo-2803715-2025-10-15",
      "headline": "Pakistan made it hard for us: Nat Sciver-Brunt admits England's shoddy battingWomen's World Cup, ENG vs PAK: Nat Sciver-Brunt admitted that England's batting against Pakistan fell short as the clash at R Premadasa Stadium in Colombo was called off due to rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/denmark-open-satwiksairaj-rankireddy-chirag-shetty-first-round-lakshya-sen-2803710-2025-10-15",
      "headline": "Denmark Open: Satwik-Chirag move into 2nd round after comeback win over Scotland duoIndian shuttlers Satwik and Chirag overcame a tough challenge to progress at the Denmark Open. Their victory boosts India's chances but mixed doubles pair crashed out early."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-shan-masood-happy-babar-azam-realistic-expectations-lahore-2803699-2025-10-15",
      "headline": "PAK vs SA: Shan Masood backs Babar Azam's Test return, urges realistic expectationsPakistan captain Shan Masood praised Babar Azam's confident return as Pakistan defeated South Africa by 93 runs in Lahore. The win ended South Africa's 10-match Test winning streak and gave Pakistan a crucial series lead."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}