{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-2025-date-time-and-everything-investors-must-know-2804174-2025-10-16",
      "headline": "Diwali Muhurat Trading 2025: Date, time and everything investors must knowThis year's Muhurat Trading will take place on Tuesday, October 21, 2025. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-job-here-is-how-much-pf-you-can-withdraw-under-new-epfo-rules-2804170-2025-10-16",
      "headline": "Lost job? Here's how much PF you can withdraw under new EPFO rulesEPFO said the change is meant to safeguard retirement savings while still allowing access during tough times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/infosys-announces-rs-23-interim-dividend-check-record-date-q2-earnings-details-2804139-2025-10-16",
      "headline": "Infosys announces Rs 23 interim dividend. Check record date, payout detailsInfosys sweetened investor sentiment this Dhanteras week with a robust quarterly performance and a Rs 23 interim dividend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/infosys-q2-results-earnings-net-profit-revenue-dividend-guidance-2804121-2025-10-16",
      "headline": "Infosys Q2 profit rises 13% to Rs 7,364 crore; declares Rs 23 interim dividendInfosys revised the lower end of its full-year revenue guidance upward to 2–3%, compared with 1–3% earlier, reflecting cautious optimism amid a challenging global IT environment. The operating margin forecast for FY26 was retained at 20–22%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-862-points-higher-nifty-above-25600-titan-up-3-percent-2804050-2025-10-16",
      "headline": "Sensex ends 862 points higher, Nifty above 25,600; Titan up 3%The S&P BSE Sensex gained 862.23 points to end at 83,467.66, while the NSE Nifty50 added 261.75 points to close at 25,585.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-tax-on-gold-jewellery-coins-etfs-and-sgbs-explained-2804025-2025-10-16",
      "headline": "Dhanteras 2025: Tax on gold jewellery, coins, ETFs and SGBs explainedGold shopping during Dhanteras is a tradition, but the way your purchase is taxed depends on what you buy. Jewellery, coins, ETFs and Sovereign Gold Bonds all fall under different tax slabs and timelines, making awareness essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-700-points-why-is-stock-market-rising-today-3-reasons-gold-silver-rupee-q2-earnings-trade-deal-us-2803993-2025-10-16",
      "headline": "Sensex jumps 900 points: 3 reasons why stock market is rising todayBy 2:33 pm, the S&P BSE Sensex had climbed 885.28 points to 83,490.71, while the NSE Nifty50 gained 265.25 points to 25,588.80, marking a rise of over 1%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-invest-gold-or-stocks-key-factors-2803992-2025-10-16",
      "headline": "Gold or stocks: Where should investors put their money this Dhanteras?As gold rallies and equities climb, where should your money go this Dhanteras? Experts decode how investors should navigate returns, risk, and diversification to make smarter festival-season decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/nestle-layoffs-16000-job-cuts-globally-over-next-2-years-2803972-2025-10-16",
      "headline": "Nestlé to cut 16,000 jobs globally as new CEO targets sales growthThe decision comes as the company seeks to accelerate its transformation under its new chief executive, Philipp Navratil, who assumed the role in early September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/how-to-invest-in-ipos-primary-market-investing-tips-festive-diwali-picks-2803957-2025-10-16",
      "headline": "Clarity over chaos: What investors can learn this festive seasonThis festive season calls for investors to bring focus and wisdom to their financial decisions, lighting the path within their portfolios with prudence and awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-at-all-time-highs-what-should-buyers-do-this-dhanteras-2803951-2025-10-16",
      "headline": "Gold prices at all-time highs. What should buyers do this Dhanteras?With gold touching historic prices ahead of Dhanteras, shoppers are split between tradition and caution. The surge in rates has raised an important question—should you still buy now or wait?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-climb-again-will-the-rally-continue-till-dhanteras-should-you-buy-avoid-historical-data-2803940-2025-10-16",
      "headline": "Chasing the Gold rally this Dhanteras? Here's why you shouldn't go all inAs Dhanteras approaches, experts urge a cautious approach to gold investment, emphasizing its role as a hedge rather than a growth asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/group-vs-individual-health-insurance-5-things-to-know-2803908-2025-10-16",
      "headline": "Group vs individual health insurance plan: 5 things you must knowGroup insurance seems convenient, but relying solely on it can be risky. Learn why individual health insurance offers continuity, flexibility, and tax advantages, ensuring your coverage remains intact regardless of employment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-income-tax-refunds-have-dropped-16-this-year-2803896-2025-10-16",
      "headline": "Why income tax refunds have dropped 16% this yearAccording to official data from the Central Board of Direct Taxes (CBDT), income tax refunds dropped by about 16% between April and October 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/canara-robeco-amc-lists-5-percent-premium-hold-long-term-reason-explained-2803883-2025-10-16",
      "headline": "Canara Robeco AMC lists at 5% premium: Why long-term investors should stay investedCanara Robeco AMC made a weak market debut, but is it the right long-term pick? Read to know why experts believe strong fundamentals and steady growth make it a hold-worthy investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/playing-it-safe-money-making-you-poorer-personal-finance-tips-expert-explains-linkedin-post-2803870-2025-10-16",
      "headline": "Is 'playing it safe' with your money quietly making you poorer? Experts explainsMany Indians mistake inactivity for safety. But every idle rupee in your bank account loses value each day. Here's why your comfort zone might be quietly costing you wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-tcs-planning-more-job-cuts-here-is-what-the-it-firm-said-2803868-2025-10-16",
      "headline": "Is TCS planning more job cuts? Here's what the IT firm saidAmid speculation over workforce cuts, TCS has given an update on its plans. Speaking at the Q2 earnings call, the HR head shared how the company is approaching staffing and performance reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rubicon-research-share-price-market-debut-nse-bse-28-percent-listing-gains-2803855-2025-10-16",
      "headline": "Rubicon Research makes strong debut, delivers 28% listing gains to investorsThe Rs 1,377.50 crore initial public offering of Rubicon Research received a robust response from investors. The issue was open for subscription between October 9 and October 13 and was subscribed 48 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/canara-robeco-shares-market-debut-bse-nse-5-percent-premium-buy-sell-hold-review-2803843-2025-10-16",
      "headline": "Canara Robeco shares debut at 5% premium: Should you buy?The stock opened at Rs 280.25 per share on both the NSE and BSE, compared to its issue price of Rs 266. This marks a premium of 5.36% on the NSE and 5.66% on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-silver-prices-fall-after-zooming-in-four-months-dhanteras-diwali-wedding-season-india-gold-2803726-2025-10-16",
      "headline": "Will silver prices fall after Diwali? Don't toss a coin, here's the answerSilver prices have doubled in India this year on the back of industrial demand and festive buying. But experts warn of a short-term correction after Diwali, citing overvaluation and investor profit-taking. However, long-term projections on silver remain bullish. Here's what to know before buying silver on Dhanteras 2025."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-calls-marriage-to-kanye-west-toxic-cites-lack-of-stability-2804260-2025-10-16",
      "headline": "Kim Kardashian calls marriage to Kanye West toxic, cites lack of stability Beauty mogul Kim Kardashian spoke about her marriage to Kanye West. She called the relationship toxic and how it lacked stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonali-bendre-hina-khan-tear-up-over-hair-donation-on-pati-patni-aur-panga-2804224-2025-10-16",
      "headline": "Sonali Bendre, Hina Khan moved by hair donation on Pati, Patni Aur Panga Actors Sonali Bendre and Hina Khan teared up after an audience member on 'Pati, Patni Aur Panga' donated hair for cancer patients. The gesture followed a task given to Rubina Dilaik. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jim-carrey-upcoming-live-action-film-the-jetsons-2804218-2025-10-16",
      "headline": "Jim Carrey in talks to star in upcoming live-action film on The Jetsons Jim Carrey is likely to topline a live-action feature film of the popular animated show, The Jetsons. The film is scheduled to be directed by Colin Trevorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-big-diwali-test-can-thamma-bring-back-his-golden-run-2804209-2025-10-16",
      "headline": "Ayushmann Khurrana's big Diwali test: Can Thamma bring back his golden run? Ayushmann Khurrana returns to the big screen after two years with 'Thamma', his biggest festive release yet. Following a string of box office misses, the film marks a crucial moment for the actor -- one that could redefine his career both commercially and creatively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/red-white-royal-blue-gets-sequel-nicholas-galitzine-taylor-zakhar-perez-set-to-reprise-roles-2804223-2025-10-16",
      "headline": "Red, White & Royal Blue gets sequel: Nicholas-Taylor set to reprise roles? Makers have confirmed the sequel to 'Red, White & Royal Blue', titled 'Red, White & Royal Wedding', with Nicholas Galitzine and Taylor Zakhar Perez set to reprise their roles. The follow-up promises romance, royal chaos, and political drama, though plot details are being kept under wraps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-breaks-us-box-office-records-highest-grossing-international-anime-film-2804201-2025-10-16",
      "headline": "Demon Slayer: Infinity Castle is biggest international hit movie in the US 'Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle' surpasses 'Crouching Tiger, Hidden Dragon' as top-grossing international film in US history. The anime achieved USD 128.6 million in domestic box office revenue, breaking multiple records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dulhaniya-le-jayenge-30th-anniversary-kajol-says-magic-cannot-be-recreated-create-your-own-2804175-2025-10-16",
      "headline": "Create your own: Kajol says DDLJ's magic can't be recreated Actor Kajol shared her view on remaking 'Dilwale Dulhania Le Jayenge' as the film nears 30 years of release.  Iconic scenes, songs, and dialogue from the 1995 film continue to resonate with fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/wooga-squad-friendship-updates-bts-v-choi-woo-shik-park-seo-joon-park-hyung-sik-2804172-2025-10-16",
      "headline": "BTS' V reunites with Wooga Squad, shares candid friendship update Wooga Squad, including BTS' V, Choi Woo Shik, Park Seo Joon, Park Hyung Sik, and Peakboy, shared new social media updates documenting their recent meet-up. The group, known for their strong camaraderie, posted selfies and group activities while spending time together during BTS' V's break. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-addresses-marriage-rumours-patience-emotional-support-lasting-bond-sunita-ahuja-2804169-2025-10-16",
      "headline": "No one can separate us: Govinda dismisses divorce rumours with wife Sunita Ahuja Govinda publicly addressed recent rumours about his marriage, affirming his bond with Sunita Ahuja. The actor reflected on the challenges and growth within their nearly 40-year marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchans-mysterious-post-nikal-diya-leaves-fans-guessing-2804183-2025-10-16",
      "headline": "Nikal diya: Amitabh Bachchan's mysterious post leaves fans guessing Amitabh Bachchan's cryptic social media post saying \"Nikal Diya\" sparked a wave of speculation and humorous reactions from fans online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-diane-keaton-challenged-hollywood-conventional-romance-with-wit-and-realism-2803876-2025-10-16",
      "headline": "How Diane Keaton challenged Hollywood's conventional romance with wit and realism Decades on, Keaton's honest, imperfect characters still hold the mirror up to love. By replacing romantic gloss with neurosis and wit, she proved that the most complex female roles are always the most captivating. IndiaToday.in shares insights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rudra-chitte-kaun-banega-crorepati-17-juniors-viral-dance-tech-ambitions-2804107-2025-10-16",
      "headline": "KBC 17: Young contestant teaches Amitabh Bachchan viral aura farming dance Rudra Chitte, a young contestant from Vadodara, Gujarat, took the hotseat on 'Kaun Banega Crorepati' 17 Juniors Week. Rudra showcased his coding ambitions, taught dance trends to Amitabh Bachchan, and advanced through quiz rounds using lifelines effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/european-union-film-festival-returns-date-timing-venue-films-to-be-screened-what-to-expect-2804140-2025-10-16",
      "headline": "European Union Film Festival returns to Delhi on October 31: What to expect The European Union Film Festival will be held in Delhi from October 31 to November 9, featuring 28 films from EU nations and Ukraine. The screenings will be held at four central venues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jennie-makeup-line-rumours-fan-demand-industry-speculation-2024-2804039-2025-10-16",
      "headline": "Blackpink's Jennie sparks rumours of launching her own makeup brand Reports of Blackpink's Jennie potentially launching a makeup line have surfaced online. Recent brand departures and collaborations have intensified speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/viva-pop-band-reunion-diwali-party-nostalgia-fans-2804135-2025-10-16",
      "headline": "India's OG pop group Viva Girls reunite, leaving fans nostalgic. See pics Viva, India's first mainstream all-girl pop band, reunited as four of its members came together at a recent Diwali party. Fans expressed nostalgia and excitement seeing Neha Bhasin, Mahua Kamat, Pratichee Mohapatra, and Anushka Manchanda together again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-billionaire-questioned-dhruv-rathee-promoting-harmful-paan-masala-products-2804111-2025-10-16",
      "headline": "Dhruv Rathee questions SRK's paan masala endorsements amid net worth debate YouTuber Dhruv Rathee publicly questioned actor Shah Rukh Khan's endorsement of 'paan masala' brand while highlighting the actor's reported net worth. Rathee's video and social media posts urged Khan to reflect on promoting harmful products despite significant wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-calls-mother-hema-malini-her-queen-shares-special-birthday-post-2804127-2025-10-16",
      "headline": "Esha Deol calls mother Hema Malini her queen, shares special birthday post Hema Malini celebrated her 77th birthday with heartfelt wishes from daughter Esha Deol, friends, and fans, who praised her as Bollywood's evergreen \"Dream Girl.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adil-hussain-on-making-his-kabir-singh-regret-public-i-thought-what-have-i-done-2804071-2025-10-16",
      "headline": "Adil Hussain on making his Kabir Singh regret public: I thought, what have I done? Actor Adil Hussain opened up about his regret over doing 'Kabir Singh', calling it a mistake he made without reading the full script. In a new interview, he explained why he found the film misogynistic, how it affected him personally, and why he felt compelled to take responsibility for his choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-and-fall-grand-finale-winner-when-where-to-watch-prize-money-2804053-2025-10-16",
      "headline": "Rise & fall finale: When and where to watch, top contenders, prize details Aarush Bhola, Arjun Bijlani, Arbaz Patel, Dhanashree Verma, Akriti Negi and Nayandeep Rakshit are in the running to win 'Rise & Fall'. Here's when and where you can watch the grand finale of the reality show hosted by Ashneer Grover. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/will-nitish-kumar-be-bihar-chief-minister-if-nda-wins-what-amit-shah-said-2804288-2025-10-16",
      "headline": "Will Nitish Kumar be Bihar Chief Minister if NDA wins? What Amit Shah saidAmit Shah also revealed that after the last assembly elections in 2020, Nitish Kumar had approached Prime Minister Narendra Modi, emphasising that Bihar should have a Chief Minister from the BJP, as it had secured more seats than his party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-phone-call-yesterday-centre-denies-trumps-claim-that-pm-promised-to-halt-russian-oil-purchase-over-phone-2804144-2025-10-16",
      "headline": "No phone call between Trump, PM: India rejects US President's claimTrump had claimed that PM Modi had assured him India would stop buying oil from Russia, calling it \"a big step\" in his push to isolate Moscow over the war in Ukraine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kapil-sharmas-kaps-cafe-in-canada-fired-at-for-third-time-lawrence-bishnoi-gang-claims-responsibility-2804182-2025-10-16",
      "headline": "Firing at Kapil Sharma's Kap's cafe in Canada, third attack in 4 monthsKapil Sharma's Kap's Cafe in Surrey, Canada, was targeted in a third shooting, claimed by gangster Lawrence Bishnoi's associates. No injuries were reported, but repeated attacks have raised serious security concerns for the comedian and his café."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-slams-pakistan-proxy-war-charge-afghanistan-taliban-border-conflict-ceasefire-2804150-2025-10-16",
      "headline": "Pakistan's old habit: India on being blamed for conflict with TalibanPakistan-Afghanistan Conflict: In first remarks on the conflict between Pakistan and the Taliban, India firmly backed Afghanistan, saying it had a right to exercise sovereignty over its own territories."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghanistan-pakistan-war-ceasefire-pakistan-donald-trump-mediation-india-proxy-war-taliban-2804005-2025-10-16",
      "headline": "Wary of Taliban ceasefire, Pak runs to Trump, makes bizarre India claimAfghanistan-Pakistan conflict: As tensions simmer over a fragile ceasefire with the Taliban in Afghanistan, Pakistan has turned to 'peacemaker' Donald Trump to help ease tensions. Will Trump get to solve a ninth conflict soon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/all-gujarat-ministers-except-chief-minister-bhupendra-patel-resign-ahead-of-cabinet-expansion-tomorrow-2804116-2025-10-16",
      "headline": "All Gujarat ministers resign ahead of cabinet expansion; several may be droppedAround five to six ministers are likely to be retained, while the rest of the positions will be filled with new faces. The current Gujarat cabinet, which has 16 members, will be expanded to 26, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-jeweller-malabar-gold-and-diamond-boycott-calls-dhanteras-pakistani-influencer-alishba-khalid-controversy-2803981-2025-10-16",
      "headline": "Malabar Gold hit by boycott calls over Pak influencer link ahead of DhanterasJust days before Dhanteras, Kerala-based Malabar Gold & Diamonds has found itself at the centre of a social media storm. The brand is facing renewed boycott calls over its collaboration with Pakistani influencer Alishba Khalid, who, during Operation Sindoor, made anti-India remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-confuses-india-pakistan-new-prime-minister-every-year-mental-health-2803852-2025-10-16",
      "headline": "Every year a new PM: Trump's epic India-Pakistan mix-up goes viralDonald Trump said India was an incredible country and every single year it saw a new leader. However, it is not India, but Pakistan that fits that description perfectly.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-blinked-first-in-fight-between-pakistan-taliban-afghanistan-kabul-airstrike-afghan-retaliation-durand-line-2803952-2025-10-16",
      "headline": "Afghanistan-Pakistan war: Who blinked first and ran seeking truce?Afghanistan and Pakistan fought a brief but deadly war this week that left hundreds dead. Pakistan used fighter jets and drones. A 48-hour ceasefire is now in place. But who blinked first and sought mediation to end the war? Here's what we know amid claims and counterclaims."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/death-penalty-sought-for-sheikh-hasina-ex-police-chief-admits-to-mass-killings-chowdhury-abdullah-al-mamun-2804213-2025-10-16",
      "headline": "Hasina deserves 1,400 death sentences, seeking just one: Bangladesh prosecutorThe chief prosecutor demanded the death penalty for ousted Bangladeshi Prime Minister Sheikh Hasina over the killings during the agitation in July-August last year. While concluding his arguments at International Crimes Tribunal-1, the prosecutor said Hasina \"deserved 1,400 death sentences\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-silver-prices-fall-after-zooming-in-four-months-dhanteras-diwali-wedding-season-india-gold-2803726-2025-10-16",
      "headline": "Will silver prices fall after Diwali? Don't toss a coin, here's the answerSilver prices have doubled in India this year on the back of industrial demand and festive buying. But experts warn of a short-term correction after Diwali, citing overvaluation and investor profit-taking. However, long-term projections on silver remain bullish. Here's what to know before buying silver on Dhanteras 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-election-live-protests-ticket-bjp-jdu-lalu-tejashwi-yadav-2802833-2025-10-14",
      "headline": "Live: Nitish Kumar leads for now, post-poll decisions to follow, says Amit ShahThe BJP on Thursday released the list of its star campaigners for the upcoming Bihar Assembly elections, with Prime Minister Narendra Modi, Home Minister Amit Shah, Defence Minister Rajnath Singh, and BJP national president JP Nadda featuring the star-studded alignment for the NDA. On Thursday, several top BJP leaders, including Uttar Pradesh Chief Minister Yogi Adityanath, and Chhattisgarh Chief Minister Vishnu Deo Sai, addressed rallies in various parts of the state to campaign for BJP candidates. \r\nMeanwhile, Amit Shah is on a three-day visit to Bihar as the state's ruling NDA is locked in a seat-staring standoff. During the trip, he is likely to hold organisational meetings, meet leaders of alliance partners and address a few public meetings. Follow indiatoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-big-diwali-test-can-thamma-bring-back-his-golden-run-2804209-2025-10-16",
      "headline": "Ayushmann Khurrana's big Diwali test: Can Thamma bring back his golden run?Ayushmann Khurrana returns to the big screen after two years with 'Thamma', his biggest festive release yet. Following a string of box office misses, the film marks a crucial moment for the actor -- one that could redefine his career both commercially and creatively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-mallikarjun-kharge-lalu-yadav-call-resolve-seat-sharing-deadlock-mahagathbandhan-bihar-election-2804007-2025-10-16",
      "headline": "Rahul Gandhi dials Lalu Yadav to resolve Bihar seat-sharing deadlock: SourcesRahul Gandhi and Mallikarjun Kharge spoke to RJD supremo Lalu Prasad Yadav to resolve the seat-sharing deadlock in Bihar's Grand Alliance, with nominations for the first phase of polls already underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/is-the-bjp-shakha-in-czech-republic-for-real-czech-ufc-fighter-bjp-store-brand-ad-instagram-2804132-2025-10-16",
      "headline": "Is the BJP shakha in Czech Republic for real?A Czech MMA star's merchandise ad accidentally collided with Indian politics. The result: chaos in the comments section of the now-viral post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/will-nitish-kumars-rs-10000-gamble-woo-the-women-voter-in-bihar-2804231-2025-10-16",
      "headline": "Will Nitish Kumar's Rs 10,000 gamble woo the women voter in Bihar?Women voters in Bihar, prioritising safety, education, and welfare, have become decisive in elections, often outnumbering men at the polls. Cash transfers and targeted schemes by parties have made women's votes a key factor in determining outcomes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/21-year-old-heartbreaking-cancer-won-guys-see-yaa-reddit-post-devastates-internet-miracle-prayers-death-2803839-2025-10-16",
      "headline": "21-year-old's heartbreaking 'cancer won, guys' farewell post devastates InternetThe post, titled \"Cancer won guys, see ya,\" was shared on the subreddit r/TwentiesIndia this week and has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/capt-sabharwal-father-supreme-court-plea-judicial-inquiry-air-india-dreamliner-crash-close-aaib-probe-2803974-2025-10-16",
      "headline": "Air India crash: Pilot's father approaches Supreme Court seeking judicial inquiryThe pilot's father has demanded that all prior investigations conducted by the Aircraft Accident Investigation Bureau (AAIB) be treated as closed and that all material evidence be transferred to a judicially monitored committee or court of inquiry headed by a retired Supreme Court judge, with independent aviation and technical experts as members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-pm-narendra-modi-great-man-praise-dont-want-to-ruin-political-career-2803798-2025-10-16",
      "headline": "He loves me, but don't want to ruin his career: Trump's off-colour Modi jokeDonald Trump's latest praise for Prime Minister Modi came after he claimed that the latter had assured him India would halt oil purchases from Russia, describing it as a significant boost to his efforts to isolate Moscow in the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-kiran-shaw-poor-roads-garbage-dk-shivakumar-bjp-jds-congress-2803866-2025-10-16",
      "headline": "Kiran Shaw's Bengaluru infra callout gets massive public supportBiocon chief Kiran Mazumdar-Shaw's posts on Bengaluru's poor roads and garbage management drew massive online support, including BJP and JD(S) leaders. DK Shivakumar said criticism \"hurts the state.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-diane-keaton-challenged-hollywood-conventional-romance-with-wit-and-realism-2803876-2025-10-16",
      "headline": "How Diane Keaton challenged Hollywood's conventional romance with wit and realismDecades on, Keaton's honest, imperfect characters still hold the mirror up to love. By replacing romantic gloss with neurosis and wit, she proved that the most complex female roles are always the most captivating. IndiaToday.in shares insights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-love-more-loyal-when-theres-a-10x-return-2803490-2025-10-16",
      "headline": "Can 'relationship insurance' save modern relationships?We live in the era of situationships, where ghosting is normal, commitment is optional, and new dating trends pop up every other week. In such unpredictable times, do you think an insurance policy for your relationship could help it survive?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/opt-under-fire-indian-students-in-us-fear-losing-jobs-status-and-pay-2804173-2025-10-16",
      "headline": "US senator wants to end student work permits in the US. What Indians should knowA growing push in the US to curtail OPT and tax or restrict foreign student work is rattling Indian students. Policy shifts, surprise site visits and H-1B fee changes are shrinking the post-study path in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-says-chhattisgarhs-abujhmarh-north-bastar-now-naxal-free-after-170-surrender-today-2804089-2025-10-16",
      "headline": "Amit Shah declares Chhattisgarh's Abujhmarh Naxal-free after 170 Maoists surrenderThis comes a day after 27 Maoists, including 10 women, surrendered to security forces in Chhattisgarh's Sukma district. Also, 61 Maoists surrendered in Maharashtra's Gadhchiroli district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-first-national-award-win-before-kantara-sarkari-hiriya-prathamika-shaale-kaasaragodu-2804280-2025-10-16",
      "headline": "Did you know Rishab Shetty's first National Award win came before Kantara?Rishab Shetty won the National Award for Best Actor in 2022, for his role in 'Kantara' (2022). But did you know that it was not his first National Award win? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-and-ana-de-armas-parted-ways-after-nine-month-amid-wedding-buzz-2804285-2025-10-16",
      "headline": "Tom Cruise-Ana de Armas parted ways after nine-month amid wedding buzz: ReportTom Cruise and Ana de Armas have reportedly ended their relationship after nine months of dating, with sources saying \"the spark had gone.\" Despite the split, the two remain friends and are expected to continue working together on upcoming film projects."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/test-twenty-new-cricket-format-launch-2026-2804283-2025-10-16",
      "headline": "What is Test Twenty? Cricket's latest format explained A new format is all set to take the cricketing world by storm as Test Twenty was launched on Thursday, October 16. Backed by the likes of AB de Villiers, Harbhajan Singh and Clive Lloyd, Test Twenty is ready to capture the imagination of the fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-vs-argentina-polo-delhi-return-world-number-1-event-details-2804279-2025-10-16",
      "headline": "Polo returns to Delhi: India set to face World No. 1 Argentina after five years India will take on Argentina on October 25 in New Delhi, marking the return of international polo to India after a five-year hiatus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-centuries-lead-australia-to-womens-world-cup-semi-finals-2804278-2025-10-16",
      "headline": "Australia race to Women's World Cup semis as Alyssa Healy storm blows away Bangladesh Women's World Cup, AUS vs PAK: Alyssa Healy scored a 73-ball hundred as Australia stormed into the semis with a dominating 10-wicket win over Bangladesh on Thursday in Vizag after chasing down 199 with 25.1 overs to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-returns-south-africa-a-squad-india-tour-injury-2804259-2025-10-16",
      "headline": "South Africa captain Temba Bavuma to tour India for A series before November Tests South Africa's Test captain Temba Bavuma has been named in the South Africa A squad for the India tour, marking his return after a calf injury that sidelined him during the Pakistan Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-captaincy-shubman-gill-india-odi-australia-amit-mishra-2804257-2025-10-16",
      "headline": "Good for Rohit Sharma captaincy pressure isn't on him anymore: Ex-India spinner Amit Mishra feels that being relieved of captaincy will help Rohit Sharma to play for freely and help the Indian team win. Mishra also supported the idea to have Shubman Gill become captain early. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajat-patidar-century-leads-madhya-pradesh-commanding-lead-punjab-ranji-trophy-2804237-2025-10-16",
      "headline": "Rajat Patidar begins Ranji Trophy with century, continues dream red-ball run Madhya Pradesh captain Rajat Patidar continued his exceptional form in red-ball cricket, scoring an unbeaten century on Day 2 of the Ranji Trophy opener against Punjab in Indore. His composed 107 not out, supported by a crucial partnership with Venkatesh Iyer, steered Madhya Pradesh to a strong position at stumps in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ahmedabad-the-only-choice-row-brews-over-indias-2030-commonwealth-games-bid-ytvd-2804243-2025-10-16",
      "headline": "Ahmedabad The Only Choice? Row Brews Over India's 2030 Commonwealth Games Bid This special report examines India's bid to host the 2030 Commonwealth Games, with Ahmedabad being recommended as the sole host city. The focus on a single city has led to questions of fairness, as the transcript highlights, 'focusing and concentrating almost every marquee event to a single city raises serious concerns about regional equity.' While Ahmedabad has proven its capabilities by hosting events like the 2023 ICC Cricket World Cup, other capable cities like Hyderabad, Delhi, and Bhubaneswar feel overlooked. Bhubaneswar, for instance, has successfully hosted the Hockey World Cup twice. The 2010 Commonwealth Games, despite controversies, significantly upgraded Delhi's infrastructure, reinforcing the argument for distributing major events. With India also aiming to bid for the 2036 Olympics, the debate over equitable development and giving multiple cities a fair chance to become sporting hubs is intensifying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-african-spinner-mlaba-warns-of-chamari-athapaththu-threat-womens-world-cup-2804232-2025-10-16",
      "headline": "South Africa wary of Chamari Athapaththu threat in Sri Lanka clash: Nonkululeko Mlaba South African spinner Nonkululeko Mlaba highlighted Chamari Athapaththu as a major threat ahead of their Women's World Cup clash with Sri Lanka, while emphasising that the Proteas will focus on their own game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/qatars-al-haydos-pledges-gaza-school-sports-hall-2026-world-cup-qualification-2804210-2025-10-16",
      "headline": "Qatar star promises Gaza school, sporting facility after World Cup qualification Al Haydos commits to constructing a school and sports hall in Gaza as Qatar secured a World Cup spot, linking the national team's achievement to global humanitarian efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-team-booed-after-afghanistan-whitewash-2025-uae-odi-series-2804196-2025-10-16",
      "headline": "Bangladesh greeted with hostile reception after Afghanistan whitewash, cars attacked Bangladesh's cricket team faced a hostile homecoming after being whitewashed 3‑0 by Afghanistan, with fans expressing anger at poor performances and Mehidy Hasan's struggling captaincy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-letter-aiff-tender-partner-delay-patience-super-cup-2804199-2025-10-16",
      "headline": "ISL clubs lose patience as 10 teams write urgent letter to AIFF over tender delay Indian football's top clubs have lost patience as confusion deepens over AIFF's delayed tender process. After missed deadlines and zero communication, ten ISL teams are demanding transparency, accountability, and a clear plan for the league's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ahmedabad-the-only-choice-row-brews-over-indias-2030-commonwealth-games-bid-ytvd-2804243-2025-10-16",
      "headline": "Ahmedabad The Only Choice? Row Brews Over India's 2030 Commonwealth Games Bid This special report examines India's bid to host the 2030 Commonwealth Games, with Ahmedabad being recommended as the sole host city. The focus on a single city has led to questions of fairness, as the transcript highlights, 'focusing and concentrating almost every marquee event to a single city raises serious concerns about regional equity.' While Ahmedabad has proven its capabilities by hosting events like the 2023 ICC Cricket World Cup, other capable cities like Hyderabad, Delhi, and Bhubaneswar feel overlooked. Bhubaneswar, for instance, has successfully hosted the Hockey World Cup twice. The 2010 Commonwealth Games, despite controversies, significantly upgraded Delhi's infrastructure, reinforcing the argument for distributing major events. With India also aiming to bid for the 2036 Olympics, the debate over equitable development and giving multiple cities a fair chance to become sporting hubs is intensifying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-african-spinner-mlaba-warns-of-chamari-athapaththu-threat-womens-world-cup-2804232-2025-10-16",
      "headline": "South Africa wary of Chamari Athapaththu threat in Sri Lanka clash: Nonkululeko Mlaba South African spinner Nonkululeko Mlaba highlighted Chamari Athapaththu as a major threat ahead of their Women's World Cup clash with Sri Lanka, while emphasising that the Proteas will focus on their own game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/qatars-al-haydos-pledges-gaza-school-sports-hall-2026-world-cup-qualification-2804210-2025-10-16",
      "headline": "Qatar star promises Gaza school, sporting facility after World Cup qualification Al Haydos commits to constructing a school and sports hall in Gaza as Qatar secured a World Cup spot, linking the national team's achievement to global humanitarian efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-team-booed-after-afghanistan-whitewash-2025-uae-odi-series-2804196-2025-10-16",
      "headline": "Bangladesh greeted with hostile reception after Afghanistan whitewash, cars attacked Bangladesh's cricket team faced a hostile homecoming after being whitewashed 3‑0 by Afghanistan, with fans expressing anger at poor performances and Mehidy Hasan's struggling captaincy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-letter-aiff-tender-partner-delay-patience-super-cup-2804199-2025-10-16",
      "headline": "ISL clubs lose patience as 10 teams write urgent letter to AIFF over tender delay Indian football's top clubs have lost patience as confusion deepens over AIFF's delayed tender process. After missed deadlines and zero communication, ten ISL teams are demanding transparency, accountability, and a clear plan for the league's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-pak-most-watched-online-tv-viewership-2804192-2025-10-16",
      "headline": "India vs Pakistan becomes most-watched women's cricket match onlineWomen's World Cup 2025: The group stage match between India and Pakistan played on October 5 in Colombo has become the most-watched match of all-time on digital platforms. India defeated Pakistan by 86 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-viral-coffee-mug-asia-cup-2025-2804176-2025-10-16",
      "headline": "Chakravarthy breaks silence on viral coffee mug trophy post after Asia Cup winVarun Chakravarthy revealed the reason why he decided to make the coffee mug trophy post after India won the Asia Cup 2025. Varun's post went viral as the Indian players trolled Mohsin Naqvi after winning the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-umair-ranji-debut-ispl-journey-mumbai-odd-jobs-cricket-success-2804153-2025-10-16",
      "headline": "From selling sushi to Mumbai debut: Irfan Umair's dream comes alive in Ranji TrophyIrfan Umair's journey from working odd jobs in Mumbai to making his Ranji Trophy debut is a story of hard work and determination. His rise through the Indian Street Premier League (ISPL) shows how grassroots cricket can open doors to bigger opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-australia-odi-preparations-2025-2804154-2025-10-16",
      "headline": "Rohit, Kohli train side by side in 1st nets session before AUS ODI seriesRohit Sharma and Virat Kohli hit the ground running as they sweated it out in the first nets session ahead of the Australia ODI series on Thursday, October 16. Kohli and Rohit trained side by side in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-kerala-friendly-in-doubt-reports-2804143-2025-10-16",
      "headline": "Lionel Messi's international friendly in Kerala likely to be called-off: ReportLionel Messi's Kerala friendly against Australia faces uncertainty, with recent reports leaving fans anxious. Organisers insist the match is on, while the GOAT Tour in December will see him visit Kolkata, Mumbai, Ahmedabad, and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-2025-season-ends-early-health-issues-withdrawal-asian-tour-2804131-2025-10-16",
      "headline": "Amid health battles, Emma Raducanu ends season early after Ningbo Open exitEmma Raducanu ended her 2025 season early after recurring health issues forced her to withdraw following a first-round loss at the Ningbo Open. Despite setbacks, she recorded 28 wins and climbed back to World No. 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sahaja-yamalapalli-stuns-sloane-stephens-before-narrow-loss-petra-marcinko-wta-125k-tampico-2804105-2025-10-16",
      "headline": "After Sloane Stephens stunner, Sahaja Yamalapalli goes down fighting vs World No.125Sahaja Yamalapalli exited the WTA 125K Abierto Tampico after a hard-fought three-set loss to World No.125 Petra Marcinko in the Round of 16, following her stunning win over former US Open champion Sloane Stephens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-smriti-mandhana-win-icc-player-of-the-month-september-2025-2804076-2025-10-16",
      "headline": "Abhishek, Mandhana win ICC Player Of The Month awards for SeptemberAbhishek Sharma and Smriti Mandhana have been named ICC Player of the Month for September 2025, recognising their outstanding contributions in the Asia Cup T20I and home ODI series against Australia, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-kerala-friendly-in-doubt-reports-2804143-2025-10-16",
      "headline": "Lionel Messi's international friendly in Kerala likely to be called-off: ReportLionel Messi's Kerala friendly against Australia faces uncertainty, with recent reports leaving fans anxious. Organisers insist the match is on, while the GOAT Tour in December will see him visit Kolkata, Mumbai, Ahmedabad, and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-2025-season-ends-early-health-issues-withdrawal-asian-tour-2804131-2025-10-16",
      "headline": "Amid health battles, Emma Raducanu ends season early after Ningbo Open exitEmma Raducanu ended her 2025 season early after recurring health issues forced her to withdraw following a first-round loss at the Ningbo Open. Despite setbacks, she recorded 28 wins and climbed back to World No. 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sahaja-yamalapalli-stuns-sloane-stephens-before-narrow-loss-petra-marcinko-wta-125k-tampico-2804105-2025-10-16",
      "headline": "After Sloane Stephens stunner, Sahaja Yamalapalli goes down fighting vs World No.125Sahaja Yamalapalli exited the WTA 125K Abierto Tampico after a hard-fought three-set loss to World No.125 Petra Marcinko in the Round of 16, following her stunning win over former US Open champion Sloane Stephens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-smriti-mandhana-win-icc-player-of-the-month-september-2025-2804076-2025-10-16",
      "headline": "Abhishek, Mandhana win ICC Player Of The Month awards for SeptemberAbhishek Sharma and Smriti Mandhana have been named ICC Player of the Month for September 2025, recognising their outstanding contributions in the Asia Cup T20I and home ODI series against Australia, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-players-overseas-t20-leagues-ravi-shastri-message-exposure-bcci-2804085-2025-10-16",
      "headline": "Indian players in overseas T20 leagues? Ravi Shastri sends big message to BCCIRavi Shastri has urged the BCCI to allow Indian players to feature in overseas T20 leagues. He believes such exposure will help young cricketers improve skills and gain experience in different conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-fide-combined-world-champion-format-explained-magnus-carlsen-2804065-2025-10-16",
      "headline": "FIDE's Combined World Champion format: New path designed for Carlsen's return?FIDE has approved a new Combined World Champion format, which is set to begin in 2027. This innovation may transform chess championship cycles and influence Magnus Carlsen's return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-lsg-ipl-2804018-2025-10-16",
      "headline": "End of Williamson's IPL journey? Batter joins LSG as strategic advisorFormer New Zealand captain Kane Williamson has joined Lucknow Super Giants as the strategic advisor. Is this the end of Williamson's journey as a player in the IPL?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rory-mcilroy-roger-federer-golf-india-championship-2804014-2025-10-16",
      "headline": "Rory McIlroy's India debut: Inspired by Federer, golfer takes a leap of faithRory McIlroy has travelled to India for the first time. The legendary golfer is participating in the DP World India Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-golden-boy-not-nominated-explained-rules-fc-barcelona-2804000-2025-10-16",
      "headline": "Why is FC Barcelona's Lamine Yamal not in Golden Boy 2025 shortlist? ExplainedFC Barcelona and Spain wonderkid Lamine Yamal is not on the Golden Boy 2025 shortlist due to a key rule of the award. His absence is procedural, not a reflection of his talent or recent performances."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-cryptic-post-twitter-brand-promotional-video-world-cup-2027-2803984-2025-10-16",
      "headline": "Virat Kohli's cryptic X post was teaser to brand promotion, triggers meme festMany fans initially saw Virat Kohli's post as a rare glimpse into his personal thoughts, only to feel let down when it turned out to be a brand promotion. The former captian will return to international cricket on October 19 when India take on Australia in the first of a three-match ODI series in Perth. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}